{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ac66051f",
   "metadata": {},
   "source": [
    "# Loading\n",
    "\n",
    "Create a generator function for importing the file"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "a78623e8",
   "metadata": {},
   "outputs": [],
   "source": [
    "import urllib.request\n",
    "import lzma\n",
    "import base64\n",
    "import re\n",
    "\n",
    "def get_dependencies():\n",
    "    localfile, info = urllib.request.urlretrieve(\"https://github.com/ogirardot/meta-deps/raw/master/pypi-deps.csv.lzma\")\n",
    "    with lzma.open(localfile, mode='r') as file:\n",
    "        for line in file:\n",
    "            package, version, deps = line.decode(\"utf-8\").split('\\t')\n",
    "            deps = base64.b64decode(deps).decode(\"utf-8\")\n",
    "            deps = eval(deps)\n",
    "            regex = r'\\\"*([\\w\\.]+)[><]?\\=?.*\\\"*'\n",
    "            \n",
    "            def cleanDep(s):\n",
    "                try:\n",
    "                    match = re.search(regex, s)\n",
    "                    match = re.search(regex, s)\n",
    "                    s = match.group(0)\n",
    "                    s = s.replace('\"', '')\n",
    "                    s = re.split(r'<>=', s)[0]\n",
    "                    return s\n",
    "                except:\n",
    "                    return None\n",
    "            \n",
    "            deps = [cleanDep(x) for x in deps if cleanDep(x) is not None]\n",
    "            \n",
    "            yield package, deps\n",
    "        \n",
    "        \n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cdb43fb3",
   "metadata": {},
   "source": [
    "Store as dataframe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "8cec55f6",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>package</th>\n",
       "      <th>dependency</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0x10c-asm</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2gis</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3to2</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>3to2_py3k</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     package dependency\n",
       "0       None       None\n",
       "1  0x10c-asm       None\n",
       "2       2gis       None\n",
       "3       3to2       None\n",
       "4  3to2_py3k       None"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "\n",
    "rows = np.array([[None,None]])\n",
    "for package, deps in get_dependencies():\n",
    "    # Packages with no dependencies get blank string\n",
    "    if deps:\n",
    "        args= [[package, dep] for dep in deps]\n",
    "    else:\n",
    "        args = [[package, None]]\n",
    "    rows = np.append(rows, args, axis=0)\n",
    "\n",
    "        \n",
    "df = pd.DataFrame(rows, columns=[\"package\", \"dependency\"]).drop_duplicates()\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "8ddc85a3",
   "metadata": {},
   "outputs": [],
   "source": [
    "deps = pd.Series(df.dependency.unique())\n",
    "packages = pd.Series(df.package.unique())\n",
    "new_deps = deps[~deps.isin(packages)]\n",
    "new_df = pd.DataFrame({'package': new_deps, 'dependency': [None]*len(new_deps)})\n",
    "df = pd.concat([df, new_df])\n",
    "df = df.dropna(subset=['package'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "c44c2558",
   "metadata": {},
   "outputs": [],
   "source": [
    "from timeit import default_timer, timeit"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "30d02d45",
   "metadata": {},
   "source": [
    "## Redshift\n",
    "\n",
    "In Redshift we create a single table that will hold one \"edge\" per row."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "a9c3457d",
   "metadata": {},
   "outputs": [],
   "source": [
    "import redshift_connector\n",
    "conn = redshift_connector.connect(\n",
    "     host='redshift-python-dep.cantgzv41ter.us-east-1.redshift.amazonaws.com',\n",
    "     database='deps',\n",
    "     user='awsuser',\n",
    "     password='uGdipKs9WpJ8yU6'\n",
    "  )\n",
    "conn.autocommit = True\n",
    "cursor = conn.cursor()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b50201b6",
   "metadata": {},
   "source": [
    "Create the table"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "7a87dc3b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<redshift_connector.cursor.Cursor at 0x7f41dc92ae10>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cursor.execute(\"DROP TABLE dependencies\")\n",
    "cursor.execute(\n",
    "\"\"\"\n",
    "    CREATE TABLE dependencies (\n",
    "        package VARCHAR(150),\n",
    "        dependency VARCHAR(150) NULL\n",
    "    )\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dbf95b51",
   "metadata": {},
   "source": [
    "Load the data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "85ef1343",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "4195.223583109"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from itertools import product\n",
    "\n",
    "# Time it\n",
    "start = default_timer()\n",
    "\n",
    "#cursor.write_dataframe(df, \"dependencies\")\n",
    "cursor.fastexecute = True\n",
    "cursor.executemany(\"INSERT INTO dependencies VALUES (%s, %s)\", df.itertuples(index=False, name=None))\n",
    "\n",
    "end = default_timer()\n",
    "redshift_load_time = end - start\n",
    "redshift_load_time"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6ccfe301",
   "metadata": {},
   "source": [
    "# Neptune Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cc741939",
   "metadata": {},
   "source": [
    "Clear existing data from graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "47ca907d",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "1ece9237bb1c44c8aff4007e2ec712a7",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V().drop()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a6d3a769",
   "metadata": {},
   "source": [
    "Load in nodes and edges"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "c5840b9c",
   "metadata": {},
   "outputs": [],
   "source": [
    "from gremlin_python import statics\n",
    "from gremlin_python.structure.graph import Graph\n",
    "from gremlin_python.process.graph_traversal import __\n",
    "from gremlin_python.process.strategies import *\n",
    "from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n",
    "from gremlin_python.process.traversal import T\n",
    "from gremlin_python.process.traversal import Order\n",
    "from gremlin_python.process.traversal import Scope"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "ed408299",
   "metadata": {
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "def load_nodes(g, df):\n",
    "    for package_name in df.package.unique():\n",
    "        try:\n",
    "            g.add_v('package').property(T.id, package_name).as_(package_name).next()\n",
    "            #print(\"added package: \" + package_name)\n",
    "        except:\n",
    "            print(f\"Failed to add package {package_name}\")\n",
    "\n",
    "def load_edges(g, df):\n",
    "    for index, row in df.iterrows():\n",
    "        if row['dependency'] is not None:\n",
    "            g.V(row['package']).add_e(\"depends_on\").to(__.V(row['dependency'])).next()\n",
    "            #print(\"Added dependency: \" + row['package'] + \"->\" + row['dependency'])\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "d3eac779",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "163.17469938799968"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "remoteConnStr = 'wss://data516.cluster-crrfpo5iyyda.us-east-1.neptune.amazonaws.com:8182/gremlin'\n",
    "remoteConn = DriverRemoteConnection(remoteConnStr,'g')\n",
    "\n",
    "g = Graph().traversal().withRemote(remoteConn)\n",
    "\n",
    "start = default_timer()\n",
    "\n",
    "load_nodes(g, df)\n",
    "load_edges(g, df)\n",
    "\n",
    "end = default_timer()\n",
    "remoteConn.close()\n",
    "\n",
    "neptune_load_time = end - start\n",
    "neptune_load_time"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "046262db",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "bcb2bc87943340b389227316ca2c48d6",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V()\n",
    "g.E()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8ea406d6",
   "metadata": {},
   "source": [
    "# Queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b0bbbe47",
   "metadata": {},
   "source": [
    "## Helper Funcs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "e8aaffab",
   "metadata": {},
   "outputs": [],
   "source": [
    "def timeRedshiftQuery(sqlTxt):\n",
    "    cursor = conn.cursor()\n",
    "    start = default_timer()\n",
    "    cursor.execute(sqlTxt)\n",
    "    end = default_timer()\n",
    "    return (end - start) * 1000\n",
    "\n",
    "def timeNeptuneQuery(f):\n",
    "    start = default_timer()\n",
    "    g = Graph().traversal().withRemote(remoteConn)\n",
    "    end = default_timer()\n",
    "    return end - start"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "73d3e231",
   "metadata": {},
   "source": [
    "## Redshift Recursive View\n",
    "We save a view that has a row for each package and package it depends on either directly or indirectly."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "febf5fe7",
   "metadata": {},
   "source": [
    "## 1: Which package has the most direct dependencies and how many?"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "71c07e18",
   "metadata": {},
   "source": [
    "### Redshift"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "a631377d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(['Products.CMFPlone', 100],)"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cursor = conn.cursor()\n",
    "query = \"\"\"\n",
    "    SELECT TOP 1 *\n",
    "    FROM \n",
    "    (\n",
    "        SELECT DISTINCT package, count(*) as \"dep_count\"\n",
    "        FROM dependencies\n",
    "        WHERE dependency is not NULL\n",
    "        GROUP BY package\n",
    "    ) DepCounts\n",
    "    ORDER BY dep_count DESC, package ASC\n",
    "\n",
    "\"\"\"\n",
    "cursor.execute(query)\n",
    "cursor.fetchall()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "5dc92476",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "5.465979999996762"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "timeRedshiftQuery(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0951d15c",
   "metadata": {},
   "source": [
    "### Neptune"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "94d0a8bf",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "5e4bf4312fa14913832175ccff90fea2",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V().hasLabel('package').in('depends_on').\n",
    "groupCount().by(id).\n",
    "order(Scope.local).\n",
    "    by(values, Order.desc).\n",
    "    by(keys, Order.asc).\n",
    "unfold().limit(1)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "64533a85",
   "metadata": {},
   "source": [
    "# 2: Which package has the most total dependencies?\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d610cdbb",
   "metadata": {},
   "source": [
    "## Redshift"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "7bafd4af",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(['horae.planning', 130303],)"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "WITH RECURSIVE total_deps(package, dependency, level) AS \n",
    "    (SELECT package, dependency, 0 AS level \n",
    "     FROM dependencies\n",
    "     UNION ALL\n",
    "     SELECT d.package, d.dependency, level + 1\n",
    "     FROM dependencies d, total_deps p\n",
    "     WHERE \n",
    "        d.dependency = p.package AND\n",
    "        d.dependency is not NULL AND\n",
    "        level <= 50\n",
    "    )\n",
    "SELECT TOP 1 package, dep_count from\n",
    "(\n",
    "    SELECT package, count(dependency) as dep_count\n",
    "    FROM total_deps\n",
    "    GROUP BY package, dependency\n",
    ") t\n",
    "ORDER BY dep_count DESC, package ASC\n",
    "\"\"\"\n",
    "cursor.execute(query)\n",
    "cursor.fetchall()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "e7396630",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "148.2574909999812"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "timeRedshiftQuery(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c80d5fd8",
   "metadata": {},
   "source": [
    "## Neptune"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "df8b6981",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "aed56558d61b4a9686724b4e1fdea86b",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(overflow='scroll')),), _titles={'0': 'Error'})"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V().hasLabel('package').emit().repeat(__.in('depends_on')).until(\n",
    "    inE().count().is(0).or(\n",
    "    loops().count().is(15))\n",
    ").\n",
    "groupCount().by(id).\n",
    "order(Scope.local).\n",
    "    by(values, Order.desc).\n",
    "    by(keys, Order.asc).\n",
    "unfold().limit(1)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5a3a9c73",
   "metadata": {},
   "source": [
    "# 3: Which packages depend on Pandas (directly and indirectly)?"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a2ecb72e",
   "metadata": {},
   "source": [
    "## Redshift"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "a64f6284",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(['BiologicalProcessNetworks'],\n",
       " ['gyroid'],\n",
       " ['lmj.nethack'],\n",
       " ['nplook'],\n",
       " ['oceans'],\n",
       " ['pyasa'],\n",
       " ['PyBUFR'],\n",
       " ['pyorbital'],\n",
       " ['python-consume'],\n",
       " ['pyucsc'],\n",
       " ['RTM'],\n",
       " ['smith'],\n",
       " ['bw2data'],\n",
       " ['canvas'],\n",
       " ['chebpy'],\n",
       " ['daft'],\n",
       " ['emcee'],\n",
       " ['fitsio'],\n",
       " ['gceising'],\n",
       " ['gsw'],\n",
       " ['h5dj'],\n",
       " ['linguistic-helper-functions'],\n",
       " ['lmj.particle'],\n",
       " ['lmj.pursuit'],\n",
       " ['mlboost'],\n",
       " ['mofa'],\n",
       " ['nwalign'],\n",
       " ['ocupy'],\n",
       " ['pyccv'],\n",
       " ['pyssp'],\n",
       " ['topzootools'],\n",
       " ['Bravo'],\n",
       " ['colorcorrect'],\n",
       " ['his2h5'],\n",
       " ['lmj.kohonen'],\n",
       " ['lmj.plot'],\n",
       " ['metaseq'],\n",
       " ['multichain_mcmc'],\n",
       " ['pyflycapture2'],\n",
       " ['pyRserve'],\n",
       " ['readfmf'],\n",
       " ['SimpleHist'],\n",
       " ['Spear'],\n",
       " ['ADAM-Tools'],\n",
       " ['dcmt'],\n",
       " ['django-instakit'],\n",
       " ['fastinterval'],\n",
       " ['hdf5-django'],\n",
       " ['lmj.c3d'],\n",
       " ['lmj.rbm'],\n",
       " ['patsy'],\n",
       " ['zipline'],\n",
       " ['pyucsc'])"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "    WITH RECURSIVE panda_deps(package, dependency, level) AS \n",
    "    (SELECT package, dependency, 0 AS level \n",
    "     FROM dependencies\n",
    "     WHERE dependency = 'numpy'\n",
    "     UNION ALL\n",
    "     SELECT d.package, d.dependency, level + 1\n",
    "     FROM dependencies d, panda_deps p\n",
    "     WHERE d.dependency = p.package\n",
    "    )\n",
    "    SELECT package FROM panda_deps;\n",
    "\n",
    "\"\"\"\n",
    "cursor.execute(query)\n",
    "cursor.fetchall()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "da8b25db",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.004986631000065245"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "timeRedshiftQuery(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c9b0c663",
   "metadata": {},
   "source": [
    "# 4: Which packages have multiple dependency?\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "de5f11a9",
   "metadata": {},
   "source": [
    "## Redshift"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "f509da94",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(['affinitic.verifyinterface'],\n",
       " ['anyvc'],\n",
       " ['archetypes.fieldtraverser'],\n",
       " ['atreal.massloader'],\n",
       " ['Attest'],\n",
       " ['baas'],\n",
       " ['beanstalk-stack'],\n",
       " ['blanc-basic-podcast'],\n",
       " ['bowerrecipe'],\n",
       " ['carp'],\n",
       " ['celery-tracker'],\n",
       " ['celery-with-redis'],\n",
       " ['chill'],\n",
       " ['ckanrdf'],\n",
       " ['clearwind.arecibo'],\n",
       " ['cloudplay'],\n",
       " ['clwapp'],\n",
       " ['cmsplugin-blog'],\n",
       " ['codespeed'],\n",
       " ['collective.atimage.transformmenu'],\n",
       " ['collective.baseid'],\n",
       " ['collective.blog.star'],\n",
       " ['collective.blueprint.base'],\n",
       " ['collective.contentstats'],\n",
       " ['collective.folderishtypes'],\n",
       " ['collective.geo.opensearch'],\n",
       " ['collective.googlevisualization'],\n",
       " ['collective.gtags'],\n",
       " ['collective.jqueryuithememanager'],\n",
       " ['collective.nextprev'],\n",
       " ['collective.opensearch'],\n",
       " ['collective.pfg.soup'],\n",
       " ['collective.portlet.references'],\n",
       " ['collective.redirect'],\n",
       " ['collective.sugarcrm'],\n",
       " ['collective.templateengines'],\n",
       " ['compoze'],\n",
       " ['cornerstone.soup'],\n",
       " ['cursedmongo'],\n",
       " ['dataflake.ldapconnection'],\n",
       " ['django-absolute'],\n",
       " ['django-audit'],\n",
       " ['django-cacheops'],\n",
       " ['django-daguerre'],\n",
       " ['django-flickrsets'],\n",
       " ['django-geojson-tiles'],\n",
       " ['django-helpdesk'],\n",
       " ['django-html_sanitizer'],\n",
       " ['django-icons-icojoy-pointers'],\n",
       " ['django-icons-twitterjoy'],\n",
       " ['django_jinja_middleware'],\n",
       " ['django-lean'],\n",
       " ['django-lithium-api'],\n",
       " ['django-neutralityFR'],\n",
       " ['django-podcasting'],\n",
       " ['django-prospect'],\n",
       " ['django-proxylist'],\n",
       " ['django-pyvows'],\n",
       " ['django-redirector'],\n",
       " ['django-render-load'],\n",
       " ['django-rforum'],\n",
       " ['django-rms'],\n",
       " ['django-rss2rest'],\n",
       " ['django-security'],\n",
       " ['django-skwissh'],\n",
       " ['django_structurer'],\n",
       " ['django-treeadmin'],\n",
       " ['django-vellum'],\n",
       " ['dm.zopepatches.xmlrpc'],\n",
       " ['dpm'],\n",
       " ['dspace'],\n",
       " ['epc'],\n",
       " ['err'],\n",
       " ['ewb_case.portlet.get_involved'],\n",
       " ['experimental.ulocalized_time'],\n",
       " ['experimentdb'],\n",
       " ['fapws3'],\n",
       " ['fastVAR'],\n",
       " ['Flask-Cache-PyLibMC'],\n",
       " ['Flask-Tweepy'],\n",
       " ['Flask-Twip'],\n",
       " ['ftw.testing'],\n",
       " ['gmvault'],\n",
       " ['gocept.autocomplete'],\n",
       " ['gocept.bender'],\n",
       " ['gocept.collmex'],\n",
       " ['gocept.httpserverlayer'],\n",
       " ['gocept.lms'],\n",
       " ['gocept.lockd'],\n",
       " ['Graphiti'],\n",
       " ['grokcore.xmlrpc'],\n",
       " ['haufe.eggserver'],\n",
       " ['herald'],\n",
       " ['hexagonit.swfheader'],\n",
       " ['hiringpond'],\n",
       " ['horae.autocomplete'],\n",
       " ['horae.properties'],\n",
       " ['horae.reports'],\n",
       " ['infrae.layout'],\n",
       " ['inlinestyler'],\n",
       " ['inquant.contentmirror'],\n",
       " ['instrumental'],\n",
       " ['isso'],\n",
       " ['jcl'],\n",
       " ['js.i18n'],\n",
       " ['js.jquery_expandbox'],\n",
       " ['js.lesscss'],\n",
       " ['KalaPy'],\n",
       " ['lava-server'],\n",
       " ['lmj.kohonen'],\n",
       " ['locdic'],\n",
       " ['lt.django.company'],\n",
       " ['ltmo'],\n",
       " ['lxmlmiddleware'],\n",
       " ['mdx_smartypants'],\n",
       " ['MegamanicEdit'],\n",
       " ['metals'],\n",
       " ['mobi.interfaces'],\n",
       " ['model_mommy'],\n",
       " ['moksha.hub'],\n",
       " ['Momoko'],\n",
       " ['multichain_mcmc'],\n",
       " ['nfg.ratedreactions'],\n",
       " ['ngi.site.notification'],\n",
       " ['ng.site.crosswiki'],\n",
       " ['nose-bisect'],\n",
       " ['OpenElectrophy'],\n",
       " ['ordf'],\n",
       " ['pas.plugins.adpwchange'],\n",
       " ['PipeTK'],\n",
       " ['plone.multilingualbehavior'],\n",
       " ['plonetheme.delicious2'],\n",
       " ['plone.transformchain'],\n",
       " ['plone.z3ctable'],\n",
       " ['Products.CMFActionIcons'],\n",
       " ['Products.FacultyStaffDirectory'],\n",
       " ['Products.GoPantsPockets'],\n",
       " ['Products.MemoryProfiler'],\n",
       " ['Products.PloneboardPortlet'],\n",
       " ['Products.PloneSubscription'],\n",
       " ['Products.SimpleAlias'],\n",
       " ['pycloudfuse'],\n",
       " ['pycogworks.gui'],\n",
       " ['pytest-django-lite'],\n",
       " ['python-google-spreadsheet'],\n",
       " ['python-parsnip'],\n",
       " ['pyusps'],\n",
       " ['pyutilib.subprocess'],\n",
       " ['quantumcore.exceptions'],\n",
       " ['raptus.article.contentfader'],\n",
       " ['raptus.article.fader'],\n",
       " ['raptus.article.upload'],\n",
       " ['raptus.multilanguageurls'],\n",
       " ['raptus.princexml'],\n",
       " ['readfmf'],\n",
       " ['redsolutioncms.django-trusted-html'],\n",
       " ['repoze.bfg.restrequest'],\n",
       " ['repoze.slicer'],\n",
       " ['requests_proxy'],\n",
       " ['rod.recipe.ejabberd'],\n",
       " ['rod.recipe.rabbitmq'],\n",
       " ['rpclib'],\n",
       " ['actdiag'],\n",
       " ['AgileCLU'],\n",
       " ['alto'],\n",
       " ['amo-validator'],\n",
       " ['anobii.api'],\n",
       " ['anthill.querytool'],\n",
       " ['arecibo'],\n",
       " ['automa'],\n",
       " ['botox'],\n",
       " ['browsermob-proxy'],\n",
       " ['bud.nospam'],\n",
       " ['bzrsync'],\n",
       " ['camxes'],\n",
       " ['charmrunner'],\n",
       " ['cli53'],\n",
       " ['collective.akismet'],\n",
       " ['collective.amberjack.portlet'],\n",
       " ['collective.flattr'],\n",
       " ['collective.formlib.link'],\n",
       " ['collective.geo.file'],\n",
       " ['collective.gsa64'],\n",
       " ['collective.hootsuite'],\n",
       " ['collective.js.jqsmartTruncation'],\n",
       " ['collective.marshall.workflow'],\n",
       " ['collective.plone3bugfixes'],\n",
       " ['collective.portlet.keywordmatches'],\n",
       " ['collective.searchweightings'],\n",
       " ['collective.z3cform.datepicker'],\n",
       " ['Cydra'],\n",
       " ['cykooz.djangopaste'],\n",
       " ['dbag'],\n",
       " ['decoupage'],\n",
       " ['django-author'],\n",
       " ['django-bpmobile'],\n",
       " ['django-compresshtml'],\n",
       " ['django-detect-cyclic'],\n",
       " ['django-fluent-contents'],\n",
       " ['django-imagekit'],\n",
       " ['django-lb-attachments'],\n",
       " ['django-le-twitter'],\n",
       " ['salesking'],\n",
       " ['sc.apyb.pythonbrasil6'],\n",
       " ['scissors'],\n",
       " ['serve.me'],\n",
       " ['shelly'],\n",
       " ['singleplatform'],\n",
       " ['slapos.recipe.download'],\n",
       " ['softwarefabrica.django.appserver'],\n",
       " ['sphinxjp.themes.s6'],\n",
       " ['sphinxjp.themes.sphinxjp'],\n",
       " ['sqlalchemy-citext'],\n",
       " ['sterch.logfile'],\n",
       " ['tapioca'],\n",
       " ['textutil_ja'],\n",
       " ['thebot-translate'],\n",
       " ['thumbor'],\n",
       " ['times'],\n",
       " ['topzootools'],\n",
       " ['totalopenstation'],\n",
       " ['tron'],\n",
       " ['django-lfs'],\n",
       " ['django-panorama'],\n",
       " ['django-raven-metlog'],\n",
       " ['django-richtext-blog'],\n",
       " ['django-shop-postfinance'],\n",
       " ['django-twitter-tag'],\n",
       " ['django-yaba'],\n",
       " ['Dockets'],\n",
       " ['Dolt'],\n",
       " ['ebpub'],\n",
       " ['experimental.gracefulblobmissing'],\n",
       " ['Flask-Login'],\n",
       " ['foorep'],\n",
       " ['FormAlchemy'],\n",
       " ['fui.locker'],\n",
       " ['geobaza'],\n",
       " ['getpaid.verkkomaksut'],\n",
       " ['gitifyhg'],\n",
       " ['globetrotter'],\n",
       " ['gomobiletheme.basic'],\n",
       " ['gping'],\n",
       " ['grokcore.formlib'],\n",
       " ['h5dj'],\n",
       " ['haufe.monitoring'],\n",
       " ['horae.planning'],\n",
       " ['hurry.jqueryui'],\n",
       " ['hurry.slimbox'],\n",
       " ['icsemantic.langfallback'],\n",
       " ['identi'],\n",
       " ['ImageUtils'],\n",
       " ['tw2.jqplugins.fg'],\n",
       " ['txServiceRegistry'],\n",
       " ['typepadapp'],\n",
       " ['varnish-bans-manager'],\n",
       " ['virtstrap-bundler-and-npm'],\n",
       " ['ws.dependencychecker'],\n",
       " ['WSGIFilter'],\n",
       " ['wstool'],\n",
       " ['xodb'],\n",
       " ['z3c.memhunt.objgraph'],\n",
       " ['z3c.viewlet'],\n",
       " ['zc.form'],\n",
       " ['zc.sourcefactory'],\n",
       " ['zc.vault'],\n",
       " ['zeam.utils.batch'],\n",
       " ['zerobin'],\n",
       " ['zope.app.annotation'],\n",
       " ['zope.app.basicskin'],\n",
       " ['zope.app.renderer'],\n",
       " ['zope.app.wsgi'],\n",
       " ['zope.app.zopeappgenerations'],\n",
       " ['infrae.testing'],\n",
       " ['irc-pyhole'],\n",
       " ['iw.email'],\n",
       " ['jinja2-highlight'],\n",
       " ['jira-python'],\n",
       " ['js.html5_upload'],\n",
       " ['js.jquery_elastic'],\n",
       " ['js.jquery_timepicker_addon'],\n",
       " ['js.mediaelement'],\n",
       " ['mdemos.metrics'],\n",
       " ['megrok.pagetemplate'],\n",
       " ['menhir.contenttype.document'],\n",
       " ['menttes.action.createfolder'],\n",
       " ['MLizard'],\n",
       " ['mongo-connector'],\n",
       " ['montageclient'],\n",
       " ['node.ext.ldap'],\n",
       " ['noseenv'],\n",
       " ['nose-kleenex'],\n",
       " ['nous.pylons.testing'],\n",
       " ['OhlohWidgetsMacro'],\n",
       " ['pcommerce.payment.invoice'],\n",
       " ['pika_simple_daemon'],\n",
       " ['pippy'],\n",
       " ['ploddle'],\n",
       " ['plone.app.memberschema'],\n",
       " ['plone.app.texttile'],\n",
       " ['plonehrm.checklist'],\n",
       " ['plonetheme.ploneorg'],\n",
       " ['podiff'],\n",
       " ['pojson'],\n",
       " ['Products.AutoRoleFromHostHeader'],\n",
       " ['Products.CalendarListingPortlet'],\n",
       " ['zope.tales'],\n",
       " ['zopyx.smartprintng.core'],\n",
       " ['pykestrel'],\n",
       " ['PyPake'],\n",
       " ['pypi2rpm'],\n",
       " ['pyramidion'],\n",
       " ['pysimulators'],\n",
       " ['python-markdown-oembed'],\n",
       " ['python-votesmart'],\n",
       " ['pyzap'],\n",
       " ['rawimg'],\n",
       " ['redomino.social'],\n",
       " ['Relo'],\n",
       " ['repoman-client'],\n",
       " ['rpc4django'],\n",
       " ['django-filer-gallery'],\n",
       " ['sphinxjp.themecore'],\n",
       " ['fabric-virtualenv'],\n",
       " ['Flask-JSONPages'],\n",
       " ['Sprout'],\n",
       " ['openc.objectsfromlinks'],\n",
       " ['horae.attachments'],\n",
       " ['piston-mini-client'],\n",
       " ['OpenSRS'],\n",
       " ['hurry.extjs'],\n",
       " ['SeoAnalyzer'],\n",
       " ['seqdiag'],\n",
       " ['show'],\n",
       " ['simplegeo-shared'],\n",
       " ['softwarefabrica.django.drilldown'],\n",
       " ['spur'],\n",
       " ['stockpile'],\n",
       " ['sumdir'],\n",
       " ['sveeaccounts'],\n",
       " ['transmogrify.extract'],\n",
       " ['tromegle'],\n",
       " ['tw2.bootstrap.forms'],\n",
       " ['tw2.jqplugins.chosen'],\n",
       " ['twabulous'],\n",
       " ['wildcard.cleanprint'],\n",
       " ['vcstools'],\n",
       " ['raptus.article.gallery'],\n",
       " ['smartdc'],\n",
       " ['platrontools'],\n",
       " ['kinopoiskpy'],\n",
       " ['genologics'],\n",
       " ['incywincy'],\n",
       " ['gengo'],\n",
       " ['django-observer'],\n",
       " ['twython'],\n",
       " ['python-instagram'],\n",
       " ['mekk.feeds'],\n",
       " ['fatzebra'],\n",
       " ['softoy.htmltags'],\n",
       " ['storm_oracle'],\n",
       " ['cql'],\n",
       " ['tw2.jqplugins.select2'],\n",
       " ['z3c.multifieldindex'],\n",
       " ['venv_dependencies'],\n",
       " ['welder'],\n",
       " ['whizzer'],\n",
       " ['wishbone'],\n",
       " ['z3c.pt.compat'],\n",
       " ['z3c.recipe.ldap'],\n",
       " ['zc.datetimewidget'],\n",
       " ['zope2_bootstrap'],\n",
       " ['zope.app.http'],\n",
       " ['zope.app.publication'],\n",
       " ['zope.app.server'],\n",
       " ['zope.app.zptpage'],\n",
       " ['zope.ptresource'],\n",
       " ['zope.viewlet'],\n",
       " ['zopyx.trashfinder'],\n",
       " ['gocept.datetimewidget'],\n",
       " ['zope.fanstatic'],\n",
       " ['zope.app.xmlrpcintrospection'],\n",
       " ['plone.tiles'],\n",
       " ['cornerstone.cssvar'],\n",
       " ['zope.app.content'],\n",
       " ['mrs.developer'],\n",
       " ['django-thumbnailfield'],\n",
       " ['django-processedimagefield'],\n",
       " ['django-pariah'],\n",
       " ['ocupy'],\n",
       " ['lmj.pursuit'],\n",
       " ['gceising'],\n",
       " ['ore.contentmirror'],\n",
       " ['Flask-fillin'],\n",
       " ['aptop'],\n",
       " ['django-rblog'],\n",
       " ['jira-bulk-loader'],\n",
       " ['libacr'],\n",
       " ['payara'],\n",
       " ['django-vhost'],\n",
       " ['django-sync-server'],\n",
       " ['django-s3-cache'],\n",
       " ['django-polls'],\n",
       " ['js.jquery_cookie'],\n",
       " ['pyviewx.client'],\n",
       " ['Flask-Redtask'],\n",
       " ['repoze.who-use_beaker'],\n",
       " ['bebop'],\n",
       " ['upfront.foldercontents'],\n",
       " ['collective.alerts'],\n",
       " ['taskl'],\n",
       " ['m2wsgid'],\n",
       " ['django-universaltag'],\n",
       " ['sockjsproxy'],\n",
       " ['djlime-banners'],\n",
       " ['djoonga.reports'],\n",
       " ['rubygemsrecipe'],\n",
       " ['django-pylibmc-sasl'],\n",
       " ['Products.LDAPUserFolder'],\n",
       " ['tgapp-tgpolls'],\n",
       " ['yafowil.webob'],\n",
       " ['qamasu'],\n",
       " ['LinguaPlus'],\n",
       " ['repoze.what.plugins.hgwebdir'],\n",
       " ['pybamboo'],\n",
       " ['pyphant.osc'],\n",
       " ['pyramid_ratchet'],\n",
       " ['tw.jqgrid'],\n",
       " ['pjlink'],\n",
       " ['configmgr'],\n",
       " ['authgoogle-middleware'],\n",
       " ['Flask'],\n",
       " ['bookreader'],\n",
       " ['django-hudson'],\n",
       " ['cmsplugin-multiple-faq'],\n",
       " ['transmogrify.webcrawler'],\n",
       " ['pyremotecv'],\n",
       " ['DataPipeline'],\n",
       " ['django-dbstorage'],\n",
       " ['WebTestRecorder'],\n",
       " ['django-discoverage'],\n",
       " ['django-oscar-paypal'],\n",
       " ['django-rinvoices'],\n",
       " ['django-spine'],\n",
       " ['elementtreewriter'],\n",
       " ['Enqueue'],\n",
       " ['hp3parclient'],\n",
       " ['hurry.jstree'],\n",
       " ['jasmine-splinter-runner'],\n",
       " ['simplegeo'],\n",
       " ['keepassdb'],\n",
       " ['Marcos'],\n",
       " ['ndServiceRegistry'],\n",
       " ['Products.EnhancedNewsItemImage'],\n",
       " ['pyqtrailer'],\n",
       " ['quills.app'],\n",
       " ['redsolutioncms.django-tinymce-attachment'],\n",
       " ['rocketdive'],\n",
       " ['slapos.libnetworkcache'],\n",
       " ['spa-phone-api'],\n",
       " ['txlongpollfixture'],\n",
       " ['us'],\n",
       " ['WhooshAlchemy'],\n",
       " ['census'],\n",
       " ['adjutant'],\n",
       " ['anthill.exampletheme'],\n",
       " ['AuthBWC'],\n",
       " ['bda.blogview'],\n",
       " ['bda.intellidatetime'],\n",
       " ['botornado'],\n",
       " ['candy.candy'],\n",
       " ['coinor.coopr'],\n",
       " ['collective.atcassandrastorage'],\n",
       " ['collective.grok'],\n",
       " ['collective.mass_subscriptions'],\n",
       " ['collective.portlet.postit'],\n",
       " ['collective.salesforce.query'],\n",
       " ['collective.wysiwyg_biografy'],\n",
       " ['django-cache-throttle'],\n",
       " ['django-inspectional-registration'],\n",
       " ['django-polymorphic-tree'],\n",
       " ['django-shop-categories'],\n",
       " ['dnstk'],\n",
       " ['emencia_django_admin'],\n",
       " ['enpraxis.educommons'],\n",
       " ['findcmd'],\n",
       " ['five.megrok.layout'],\n",
       " ['Flask-MongoKit'],\n",
       " ['gocept.exttest'],\n",
       " ['googl'],\n",
       " ['hurry.custom'],\n",
       " ['ikazuchi.plugins.speech'],\n",
       " ['inqbus.bannerrotation'],\n",
       " ['ipdbplugin'],\n",
       " ['js.galleriffic'],\n",
       " ['js.glyphicons'],\n",
       " ['jstestnetlib'],\n",
       " ['lissues'],\n",
       " ['metascapes.web2cache'],\n",
       " ['microclimate'],\n",
       " ['nagios.responsetime'],\n",
       " ['notch.client'],\n",
       " ['openid-redis'],\n",
       " ['patin'],\n",
       " ['Products.CompositePack'],\n",
       " ['Products.DimensionWidget'],\n",
       " ['Products.HitList'],\n",
       " ['Products.JRedirector'],\n",
       " ['Products.PloneBooking'],\n",
       " ['Products.SimplePortlet'],\n",
       " ['Products.TrustedExecutables'],\n",
       " ['pydsl'],\n",
       " ['python-rdio'],\n",
       " ['reform'],\n",
       " ['release_path'],\n",
       " ['simplelayout.ui.dragndrop'],\n",
       " ['templer.django-project-app'],\n",
       " ['tha.taglist'],\n",
       " ['tinypng'],\n",
       " ['tomato'],\n",
       " ['tornado_thumbor_url'],\n",
       " ['traject'],\n",
       " ['tw2.polymaps'],\n",
       " ['upfront.simplereferencefield'],\n",
       " ['veliberator'],\n",
       " ['yafowil.widget.ace'],\n",
       " ['yafowil.widget.dynatree'],\n",
       " ['z3c.noop'],\n",
       " ['z3c.soap'],\n",
       " ['zc.cacheheaders'],\n",
       " ['zc.recipe.filestorage'],\n",
       " ['zope.app.error'],\n",
       " ['zope.i18n'],\n",
       " ['pykachu'],\n",
       " ['yaco.recipe.uwsgi'],\n",
       " ['my315ok.recipe.cpzexp'],\n",
       " ['mdvorak.recipe.qooxdoo'],\n",
       " ['z3c.offlinepack'],\n",
       " ['zope.session'],\n",
       " ['fabric-gunicorn'],\n",
       " ['celery-haystack'],\n",
       " ['django-requestlogging'],\n",
       " ['django-inviter'],\n",
       " ['retools'],\n",
       " ['django-supergeneric'],\n",
       " ['kpwrapper'],\n",
       " ['nwdiag'],\n",
       " ['aws.authrss'],\n",
       " ['blockdiagcontrib-class'],\n",
       " ['buildout.dumppickedversions'],\n",
       " ['buildout.eggnest'],\n",
       " ['bundle-celery'],\n",
       " ['ckanext'],\n",
       " ['classix'],\n",
       " ['collective.atspreadsheet'],\n",
       " ['collective.behavior.contactinfo'],\n",
       " ['collective.recipe.mockedeggs'],\n",
       " ['collective.transform.creole'],\n",
       " ['colorific'],\n",
       " ['confuzzle'],\n",
       " ['cotendo'],\n",
       " ['dateable.kalends'],\n",
       " ['django-datatables-view'],\n",
       " ['django-icons-famfamfam'],\n",
       " ['django-modify-history'],\n",
       " ['django-uuidfield'],\n",
       " ['djungle-sizzle'],\n",
       " ['evg.recipe.activate'],\n",
       " ['five.megrok.menu'],\n",
       " ['five.pt'],\n",
       " ['Flask-WeasyPrint'],\n",
       " ['ftw.blog'],\n",
       " ['getpaid.luottokunta'],\n",
       " ['getpaid.paymentprocessors'],\n",
       " ['gocept.recordserialize'],\n",
       " ['haufe.hrs.configuration'],\n",
       " ['hurry.qunit'],\n",
       " ['ifstat'],\n",
       " ['kforgeinstall'],\n",
       " ['klaviyo'],\n",
       " ['libthumbor'],\n",
       " ['luminoso-api'],\n",
       " ['mr.monster'],\n",
       " ['pcommerce.shipment.pickup'],\n",
       " ['porkchop'],\n",
       " ['Products.ECAutoAssessmentBox'],\n",
       " ['Products.LDAPMultiPlugins'],\n",
       " ['Pyrametros'],\n",
       " ['python-Levenshtein'],\n",
       " ['qi.jwMedia'],\n",
       " ['sd.analytics'],\n",
       " ['silva.pas.base'],\n",
       " ['skarabaeus-server'],\n",
       " ['spyral'],\n",
       " ['treq'],\n",
       " ['tweepy-utils'],\n",
       " ['unimr.eteachingxml'],\n",
       " ['yaco.hghooks'],\n",
       " ['benchmaster'],\n",
       " ['caldav'],\n",
       " ['carbon'],\n",
       " ['cipher.callscript'],\n",
       " ['cloudprinting'],\n",
       " ['cmsplugin-pygments'],\n",
       " ['collective.blueprint.jsonmigrator'],\n",
       " ['collective.contextualcontactinfo'],\n",
       " ['collective.ie8nomore'],\n",
       " ['collective.js.innerfade'],\n",
       " ['collective.namedfile'],\n",
       " ['csvplait'],\n",
       " ['datanommer.commands'],\n",
       " ['datautil'],\n",
       " ['django-cacheback'],\n",
       " ['django-celery-with-mongodb'],\n",
       " ['django-compound-field'],\n",
       " ['django-environment'],\n",
       " ['django-forums'],\n",
       " ['django-longform'],\n",
       " ['django-oauth2-provider'],\n",
       " ['django-openbudget'],\n",
       " ['django-organizations'],\n",
       " ['django-otp-twilio'],\n",
       " ['django-sekh'],\n",
       " ['django-skrill'],\n",
       " ['django-staticfiles'],\n",
       " ['django-testcoverage'],\n",
       " ['django-warthog'],\n",
       " ['djrill'],\n",
       " ['ely.kupu_useragent_patch'],\n",
       " ['ely.tinymce_kupu_useragent_patch'],\n",
       " ['erp5.extension.sectionextender'],\n",
       " ['Flask-CouchDBKit'],\n",
       " ['Flask-FlatPages'],\n",
       " ['Flask-StatsD'],\n",
       " ['fourdigits.recipe.supervisor'],\n",
       " ['ftw.dictstorage'],\n",
       " ['ftw.notification.email'],\n",
       " ['ftw.usermanagement'],\n",
       " ['fussy'],\n",
       " ['gaesynkit'],\n",
       " ['gffutils'],\n",
       " ['gomobile.imageinfo'],\n",
       " ['incf.dai'],\n",
       " ['InsideTrac'],\n",
       " ['js'],\n",
       " ['jsonrpc2-zeromq'],\n",
       " ['lingua'],\n",
       " ['listy-django-cache'],\n",
       " ['mailprocess'],\n",
       " ['megrok.resourceviewlet'],\n",
       " ['megrok.strictrequire'],\n",
       " ['metanl'],\n",
       " ['monger'],\n",
       " ['mongodoc'],\n",
       " ['niteoweb.loginas'],\n",
       " ['nose-quickunit'],\n",
       " ['ploddle.web'],\n",
       " ['plone.mocktestcase'],\n",
       " ['plonetheme.broadcaster'],\n",
       " ['Products.atctflashpatch'],\n",
       " ['Products.mcdutils'],\n",
       " ['Products.naked_plone'],\n",
       " ['Products.PasswordStrength'],\n",
       " ['Products.PluggableAuthService'],\n",
       " ['Products.Reflecto'],\n",
       " ['pydict'],\n",
       " ['pyfaze'],\n",
       " ['pyLICORS'],\n",
       " ['PyOFC2-op'],\n",
       " ['assetgen'],\n",
       " ['bamboo'],\n",
       " ['blockdiagcontrib-square'],\n",
       " ['blogen'],\n",
       " ['Boris'],\n",
       " ['celery-with-mongodb'],\n",
       " ['ckanext-datapreview'],\n",
       " ['collective.deepsitemap'],\n",
       " ['collective.lorem'],\n",
       " ['collective.portlet.skype'],\n",
       " ['collective.portlet.usertrack'],\n",
       " ['collective.projekktor'],\n",
       " ['collective.recipe.funkload'],\n",
       " ['collective.recipe.ropeproject'],\n",
       " ['Command-Tools'],\n",
       " ['CommonBWC'],\n",
       " ['crank'],\n",
       " ['d2m.rendersource'],\n",
       " ['digipy'],\n",
       " ['Django-Actuary'],\n",
       " ['django-bitfield'],\n",
       " ['django_counters'],\n",
       " ['django-decorators'],\n",
       " ['django-ebaysync'],\n",
       " ['django-icons-icojoy'],\n",
       " ['django-icons-tango'],\n",
       " ['pyrally'],\n",
       " ['pytest-timeout'],\n",
       " ['python-rexster'],\n",
       " ['redsolution.djangorecipe'],\n",
       " ['relocator'],\n",
       " ['rum-repoze-what'],\n",
       " ['sharepoint'],\n",
       " ['Shelley'],\n",
       " ['simplerpc'],\n",
       " ['slc.cleanwordpastedtext'],\n",
       " ['smith'],\n",
       " ['sPickle'],\n",
       " ['django-livestats'],\n",
       " ['django-localflavor-sl'],\n",
       " ['django-queued-storage-fork'],\n",
       " ['django-report-builder'],\n",
       " ['django-shop-multiplecurrencies'],\n",
       " ['django-templateloaderwithpriorities'],\n",
       " ['django-voice'],\n",
       " ['empire'],\n",
       " ['erp5.util'],\n",
       " ['eukalypse'],\n",
       " ['example.rtsubsites_theme'],\n",
       " ['FakeZopeInterface'],\n",
       " ['Flask-Classy'],\n",
       " ['stroller'],\n",
       " ['td-logger'],\n",
       " ['thumbor_riak'],\n",
       " ['timecop'],\n",
       " ['topp.recipes.opvarnish'],\n",
       " ['transmogrify.sqlalchemy'],\n",
       " ['ttapi'],\n",
       " ['txoauth'],\n",
       " ['van.reposync'],\n",
       " ['VKAppAuth'],\n",
       " ['wac'],\n",
       " ['wag'],\n",
       " ['Wally'],\n",
       " ['Flask-MongoSet'],\n",
       " ['Flask-OAuth'],\n",
       " ['Flask-SuperAdmin'],\n",
       " ['Flask-Uploads'],\n",
       " ['foaftmda'],\n",
       " ['furl'],\n",
       " ['galerts'],\n",
       " ['gocept.paypal'],\n",
       " ['googlecl'],\n",
       " ['hghooks'],\n",
       " ['hn'],\n",
       " ['iccommunity.mailman'],\n",
       " ['irclog'],\n",
       " ['iw.subversion'],\n",
       " ['zkaffold'],\n",
       " ['zope.pypisupport'],\n",
       " ['js.angular'],\n",
       " ['js.jquery_globalize'],\n",
       " ['lava-scheduler-tool'],\n",
       " ['martINI'],\n",
       " ['medialog.subskinsiii'],\n",
       " ['ng.site.content'],\n",
       " ['ownpaste'],\n",
       " ['palette_detect'],\n",
       " ['panda'],\n",
       " ['Petrified'],\n",
       " ['Plomino'],\n",
       " ['Products.ATBiblioStyles'],\n",
       " ['Products.PloneFilesZip'],\n",
       " ['Products.Quills'],\n",
       " ['Products.Quota'],\n",
       " ['pump'],\n",
       " ['pydataportability.model.resource'],\n",
       " ['pyg_test_dev'],\n",
       " ['pyjsiocompile'],\n",
       " ['PyOPC'],\n",
       " ['tgext.xmlrpc'],\n",
       " ['django-otp-yubikey'],\n",
       " ['django-section'],\n",
       " ['rst2hatena'],\n",
       " ['Flask-Lastuser'],\n",
       " ['Flask-Holster'],\n",
       " ['xhostplus.social'],\n",
       " ['bingpy'],\n",
       " ['wordstream'],\n",
       " ['WSGIProxy'],\n",
       " ['Seraph'],\n",
       " ['raptus.article.randomimage'],\n",
       " ['raptus.article.randomcontent'],\n",
       " ['requests-cache'],\n",
       " ['tenderloin'],\n",
       " ['ffsync'],\n",
       " ['raptus.article.hidecolumns'],\n",
       " ['rapydcss'],\n",
       " ['redsolutioncms.django-simple-feedback'],\n",
       " ['refline.srccheck'],\n",
       " ['remoteobjects'],\n",
       " ['repoze-oauth-plugin'],\n",
       " ['requests-facebook'],\n",
       " ['sanetime'],\n",
       " ['sendtx'],\n",
       " ['slc.dublettefinder'],\n",
       " ['softoy.traversalers'],\n",
       " ['softwarefabrica.django.crud'],\n",
       " ['Solgema.PortletsManager'],\n",
       " ['sphinxcontrib-recentpages'],\n",
       " ['stacklogger'],\n",
       " ['thebot-instagram'],\n",
       " ['tw2.dynforms'],\n",
       " ['tw2.slideymenu'],\n",
       " ['unclebob'],\n",
       " ['webservices'],\n",
       " ['JSON-Datetime'],\n",
       " ['dnsimple-api'],\n",
       " ['say'],\n",
       " ['pytrace'],\n",
       " ['souper.plone'],\n",
       " ['tw2.jqplugins.fullcalendar'],\n",
       " ['busyflow.pivotal'],\n",
       " ['yafowil.werkzeug'],\n",
       " ['zope.app.skins'],\n",
       " ['tw2.wysihtml5'],\n",
       " ['PyBUFR'],\n",
       " ['Flask-Testing'],\n",
       " ['collective.anotherdynamicgroupsplugin'],\n",
       " ['GetLatestTinderbox'],\n",
       " ['tw2.tipster'],\n",
       " ['Ella-Galleries'],\n",
       " ['django-post_office'],\n",
       " ['compmake'],\n",
       " ['django-tumblr-auth'],\n",
       " ['s3sourcedependencies'],\n",
       " ['wsapi4plone.core'],\n",
       " ['django-posts'],\n",
       " ['django-session-attachments'],\n",
       " ['django-shop-paypal'],\n",
       " ['gaeflickrlib'],\n",
       " ['pydataportability.xrd'],\n",
       " ['django-doccloud'],\n",
       " ['z3c.schemadiff'],\n",
       " ['MAGPlus'],\n",
       " ['redsolutioncms.django-model-url'],\n",
       " ['slc.calendarfetcher'],\n",
       " ['tgapp-youtubevideo'],\n",
       " ['zc.signalhandler'],\n",
       " ['django-future'],\n",
       " ['bda.plone.finder'],\n",
       " ['Clutch'],\n",
       " ['Flask-RESTful'],\n",
       " ['boto_utils'],\n",
       " ['django-email-test'],\n",
       " ['django-localcrawler'],\n",
       " ['D2LValence'],\n",
       " ['django-auth-fogbugz'],\n",
       " ['fancy_tag'],\n",
       " ['django-oscar-stores'],\n",
       " ['pd.imalyzer'],\n",
       " ['pytest-codecheckers'],\n",
       " ['bda.plone.wfintranet'],\n",
       " ['cioppino.twothumbs'],\n",
       " ['cjktools'],\n",
       " ['CodernityDB-HTTP'],\n",
       " ['collective.blog.feeds'],\n",
       " ['collective.dnifield'],\n",
       " ['collective.recipe.zope2cluster'],\n",
       " ['collective.registry'],\n",
       " ['Divisi'],\n",
       " ['django-openid-consumer'],\n",
       " ['djangorecipe'],\n",
       " ['django-sitemetrics'],\n",
       " ['django-smokealarm'],\n",
       " ['django-staticblocks'],\n",
       " ['django-statsd-patches'],\n",
       " ['django-tls'],\n",
       " ['djungle-backbone'],\n",
       " ['DoFler'],\n",
       " ['fb.py'],\n",
       " ['foaflib'],\n",
       " ['futuregrid.virtual.cluster'],\n",
       " ['gitblogger'],\n",
       " ['gocept.imapapi'],\n",
       " ['gp.recipe.pip'],\n",
       " ['Hoboken'],\n",
       " ['horae.timeaware'],\n",
       " ['Humus'],\n",
       " ['hurry.jqgrid'],\n",
       " ['IPyMongo'],\n",
       " ['ityou.bluetheme'],\n",
       " ['js.jquery_colorpicker'],\n",
       " ['js.jquery_validation_engine'],\n",
       " ['Kaylee'],\n",
       " ['kupu.mashups'],\n",
       " ['markdown-macros'],\n",
       " ['msgpack-rpc-python'],\n",
       " ['neo'],\n",
       " ['nudge'],\n",
       " ['pbp.recipe.noserunner'],\n",
       " ['pingpower.coolblue'],\n",
       " ['Products.CCSQLMethods'],\n",
       " ['Products.PloneTableless'],\n",
       " ['pylogd'],\n",
       " ['pyramid-openid'],\n",
       " ['pyrobot.brewery'],\n",
       " ['python-weewar'],\n",
       " ['pyutilib.excel'],\n",
       " ['raptus.article.contentflow'],\n",
       " ['raptus.rolefield'],\n",
       " ['RelStorage'],\n",
       " ['routr-schema'],\n",
       " ['saimmutable'],\n",
       " ['secobj'],\n",
       " ['slimish_jinja'],\n",
       " ['snmpdesk'],\n",
       " ['svgsitemap'],\n",
       " ['svnpoller'],\n",
       " ['swiss'],\n",
       " ['vice.zope2.outbound'],\n",
       " ['xhostplus.gallery'],\n",
       " ['xml2rfc'],\n",
       " ['xmlbegone'],\n",
       " ['zope.processlifetime'],\n",
       " ['ttrack'],\n",
       " ['bda.calendar.base'],\n",
       " ['sql-to-graphite'],\n",
       " ['bam2fpkc'],\n",
       " ['js.json'],\n",
       " ['django-aesfield'],\n",
       " ['virtualenvcontext'],\n",
       " ['django-simple-rest'],\n",
       " ['django-skylark'],\n",
       " ['GifTiffLoader'],\n",
       " ['nosetalisker'],\n",
       " ['Teleportd'],\n",
       " ['ckanext-wordpresser'],\n",
       " ['collective.imageinbox'],\n",
       " ['collective.js.slimbox2'],\n",
       " ['collective.pfg.sslfield'],\n",
       " ['collective.portlet.links'],\n",
       " ['collective.viewlet.links'],\n",
       " ['django-goto-url'],\n",
       " ['django-multi-sessions'],\n",
       " ['django-server-config'],\n",
       " ['EllipseFitter'],\n",
       " ['fitbit'],\n",
       " ['futuregrid.cloud.metric'],\n",
       " ['greenapple'],\n",
       " ['hbase-thrift'],\n",
       " ['httplibfix'],\n",
       " ['hurry.jquery'],\n",
       " ['mixpanel_django'],\n",
       " ['openstack.nose_plugin'],\n",
       " ['pkgextension'],\n",
       " ['plonetheme.netsightintranet'],\n",
       " ['Products.AttachmentField'],\n",
       " ['Products.FamFamFam'],\n",
       " ['Products.PloneboardModerationWorkflow'],\n",
       " ['Products.TimeRangeWidget'],\n",
       " ['pybrainhoney'],\n",
       " ['pyconv'],\n",
       " ['raptus.article.listings'],\n",
       " ['rbco.nautilusscripts'],\n",
       " ['sneazr'],\n",
       " ['tgapp-tgcomments'],\n",
       " ['tgext.debugbar'],\n",
       " ['ua-parser'],\n",
       " ['xhostplus.intropage'],\n",
       " ['CAPTCHAmiddleware'],\n",
       " ['collective.catalogexport'],\n",
       " ['collective.contentrules.parentchild'],\n",
       " ['collective.jqganalytics'],\n",
       " ['collective.portlet.facet'],\n",
       " ['dargparse'],\n",
       " ['delicious_links'],\n",
       " ['DevAuth'],\n",
       " ['django-awesome-snippets'],\n",
       " ['django-configglue'],\n",
       " ['django-disco'],\n",
       " ['django-postfix'],\n",
       " ['FightForNetNeutrality'],\n",
       " ['flask-beans'],\n",
       " ['Flask-DBConfig'],\n",
       " ['Flask-Should-DSL'],\n",
       " ['gtt-python-client'],\n",
       " ['gutter'],\n",
       " ['ImageContour'],\n",
       " ['js.bootstrap_image_gallery'],\n",
       " ['js.jquery_flot'],\n",
       " ['js.jquery_url_parser'],\n",
       " ['mdx_outline'],\n",
       " ['metargs'],\n",
       " ['MozillaPulse'],\n",
       " ['ng.skin.crosswiki'],\n",
       " ['p4a-build'],\n",
       " ['pets'],\n",
       " ['ploddle.collector'],\n",
       " ['plonehrm.notes'],\n",
       " ['Products.ParsedXML'],\n",
       " ['Pycabulary'],\n",
       " ['pyfinger'],\n",
       " ['pyhdhomerun'],\n",
       " ['raptus.carousel'],\n",
       " ['Refugee'],\n",
       " ['riakkit'],\n",
       " ['RimuDNS'],\n",
       " ['batchhttp'],\n",
       " ['charbeat'],\n",
       " ['Cobaya'],\n",
       " ...)"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "WITH RECURSIVE total_deps(package, dependency, level) AS \n",
    "    (SELECT package, dependency, 0 AS level \n",
    "     FROM dependencies\n",
    "     UNION ALL\n",
    "     SELECT d.package, d.dependency, level + 1\n",
    "     FROM dependencies d, total_deps p\n",
    "     WHERE \n",
    "        d.dependency = p.package AND\n",
    "        d.dependency is NOT NULL AND\n",
    "        level <= 50\n",
    "    )\n",
    "SELECT DISTINCT package from\n",
    "(\n",
    "    SELECT package, count(dependency) as total_paths\n",
    "    FROM total_deps\n",
    "    GROUP BY package, dependency\n",
    "    HAVING total_paths > 1\n",
    ") t\n",
    "\"\"\"\n",
    "cursor.execute(query)\n",
    "cursor.fetchall()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "f4820f5f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.022346106999975746"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "timeRedshiftQuery(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "57c6cb2c",
   "metadata": {},
   "source": [
    "## Neptune\n",
    "\n",
    "From each node, traverse out. Store visited nodes, and return if a visited node is found."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "41b4f45a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "a4f60be71c1a43ce96f73a05501b2b7b",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V().as('a').\n",
    "    repeat(aggregate('visited').out()).until(out().as('visited')).\n",
    "    select('a').dedup()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "399cde96",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.12"
  },
  "vscode": {
   "interpreter": {
    "hash": "3456ba5553292bb9313a9bc921b55584f884fd3b1c83a676f0c4a9c1b2dbc3c3"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
