{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ac66051f",
   "metadata": {},
   "source": [
    "# Loading\n",
    "\n",
    "Create a generator function for importing the file"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "a78623e8",
   "metadata": {},
   "outputs": [],
   "source": [
    "import urllib.request\n",
    "import lzma\n",
    "import base64\n",
    "import re\n",
    "\n",
    "def get_dependencies():\n",
    "    localfile, info = urllib.request.urlretrieve(\"https://github.com/ogirardot/meta-deps/raw/master/pypi-deps.csv.lzma\")\n",
    "    with lzma.open(localfile, mode='r') as file:\n",
    "        for line in file:\n",
    "            package, version, deps = line.decode(\"utf-8\").split('\\t')\n",
    "            deps = base64.b64decode(deps).decode(\"utf-8\")\n",
    "            deps = eval(deps)\n",
    "            regex = r'\\\"*([\\w\\.]+)[><]?\\=?.*\\\"*'\n",
    "            \n",
    "            def cleanDep(s):\n",
    "                try:\n",
    "                    match = re.search(regex, s)\n",
    "                    match = re.search(regex, s)\n",
    "                    s = match.group(0)\n",
    "                    s = s.replace('\"', '')\n",
    "                    s = re.split(r'<>=', s)[0]\n",
    "                    return s\n",
    "                except:\n",
    "                    return None\n",
    "            \n",
    "            deps = [cleanDep(x) for x in deps if cleanDep(x) is not None]\n",
    "            \n",
    "            yield package, deps\n",
    "        \n",
    "        \n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cdb43fb3",
   "metadata": {},
   "source": [
    "Store as dataframe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "8cec55f6",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>package</th>\n",
       "      <th>dependency</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0x10c-asm</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2gis</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3to2</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>3to2_py3k</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     package dependency\n",
       "0       None       None\n",
       "1  0x10c-asm       None\n",
       "2       2gis       None\n",
       "3       3to2       None\n",
       "4  3to2_py3k       None"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "\n",
    "rows = np.array([[None,None]])\n",
    "for package, deps in get_dependencies():\n",
    "    # Packages with no dependencies get blank string\n",
    "    if deps:\n",
    "        args= [[package, dep] for dep in deps]\n",
    "    else:\n",
    "        args = [[package, None]]\n",
    "    rows = np.append(rows, args, axis=0)\n",
    "\n",
    "        \n",
    "df = pd.DataFrame(rows, columns=[\"package\", \"dependency\"]).drop_duplicates()\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "8ddc85a3",
   "metadata": {},
   "outputs": [],
   "source": [
    "deps = pd.Series(df.dependency.unique())\n",
    "packages = pd.Series(df.package.unique())\n",
    "new_deps = deps[~deps.isin(packages)]\n",
    "new_df = pd.DataFrame({'package': new_deps, 'dependency': [None]*len(new_deps)})\n",
    "df = pd.concat([df, new_df])\n",
    "df = df.dropna(subset=['package'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "c44c2558",
   "metadata": {},
   "outputs": [],
   "source": [
    "from timeit import default_timer, timeit"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "30d02d45",
   "metadata": {},
   "source": [
    "## Redshift\n",
    "\n",
    "In Redshift we create a single table that will hold one \"edge\" per row."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "a9c3457d",
   "metadata": {},
   "outputs": [],
   "source": [
    "import redshift_connector\n",
    "conn = redshift_connector.connect(\n",
    "     host='redshift-python-dep.cantgzv41ter.us-east-1.redshift.amazonaws.com',\n",
    "     database='deps',\n",
    "     user='awsuser',\n",
    "     password='REDACTED'\n",
    "  )\n",
    "conn.autocommit = True\n",
    "cursor = conn.cursor()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b50201b6",
   "metadata": {},
   "source": [
    "Create the table"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "7a87dc3b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<redshift_connector.cursor.Cursor at 0x7f5ccf168850>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cursor.execute(\"DROP TABLE dependencies\")\n",
    "cursor.execute(\n",
    "\"\"\"\n",
    "    CREATE TABLE dependencies (\n",
    "        package VARCHAR(150),\n",
    "        dependency VARCHAR(150) NULL\n",
    "    )\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dbf95b51",
   "metadata": {},
   "source": [
    "Load the data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "85ef1343",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "2338.004424226"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from itertools import product\n",
    "\n",
    "# Time it\n",
    "start = default_timer()\n",
    "\n",
    "#cursor.write_dataframe(df, \"dependencies\")\n",
    "cursor.executemany(\"INSERT INTO dependencies VALUES (%s, %s)\", df.itertuples(index=False, name=None))\n",
    "\n",
    "end = default_timer()\n",
    "redshift_load_time = end - start\n",
    "redshift_load_time"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6ccfe301",
   "metadata": {},
   "source": [
    "# Neptune Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cc741939",
   "metadata": {},
   "source": [
    "Clear existing data from graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "47ca907d",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "d0d71ca19eea4b0d91f84af3ae49a97f",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V().drop()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a6d3a769",
   "metadata": {},
   "source": [
    "Load in nodes and edges"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "c5840b9c",
   "metadata": {},
   "outputs": [],
   "source": [
    "from gremlin_python import statics\n",
    "from gremlin_python.structure.graph import Graph\n",
    "from gremlin_python.process.graph_traversal import __\n",
    "from gremlin_python.process.strategies import *\n",
    "from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n",
    "from gremlin_python.process.traversal import T\n",
    "from gremlin_python.process.traversal import Order\n",
    "from gremlin_python.process.traversal import Scope"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "ed408299",
   "metadata": {
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "def load_nodes(g, df):\n",
    "    for package_name in df.package.unique():\n",
    "        try:\n",
    "            g.add_v('package').property(T.id, package_name).as_(package_name).next()\n",
    "            #print(\"added package: \" + package_name)\n",
    "        except:\n",
    "            print(f\"Failed to add package {package_name}\")\n",
    "\n",
    "def load_edges(g, df):\n",
    "    for index, row in df.iterrows():\n",
    "        if row['dependency'] is not None:\n",
    "            g.V(row['package']).add_e(\"depends_on\").to(__.V(row['dependency'])).next()\n",
    "            #print(\"Added dependency: \" + row['package'] + \"->\" + row['dependency'])\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "d3eac779",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "156.96739027900003"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "remoteConnStr = 'wss://[NEPTUNE URL]:8182/gremlin'\n",
    "remoteConn = DriverRemoteConnection(remoteConnStr,'g')\n",
    "\n",
    "g = Graph().traversal().withRemote(remoteConn)\n",
    "\n",
    "start = default_timer()\n",
    "\n",
    "load_nodes(g, df)\n",
    "load_edges(g, df)\n",
    "\n",
    "end = default_timer()\n",
    "remoteConn.close()\n",
    "\n",
    "neptune_load_time = end - start\n",
    "neptune_load_time"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "046262db",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "9309eb0ed49e42689e25d04a062c9326",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V()\n",
    "g.E()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8ea406d6",
   "metadata": {},
   "source": [
    "# Queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b0bbbe47",
   "metadata": {},
   "source": [
    "## Helper Funcs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "e8aaffab",
   "metadata": {},
   "outputs": [],
   "source": [
    "def timeRedshiftQuery(sqlTxt):\n",
    "    cursor = conn.cursor()\n",
    "    start = default_timer()\n",
    "    cursor.execute(sqlTxt)\n",
    "    end = default_timer()\n",
    "    return end - start\n",
    "\n",
    "def timeNeptuneQuery(f):\n",
    "    start = default_timer()\n",
    "    g = Graph().traversal().withRemote(remoteConn)\n",
    "    end = default_timer()\n",
    "    return end - start"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2bbc990f",
   "metadata": {},
   "source": [
    "## Redshift Recursive View\n",
    "We save a view that has a row for each package and package it depends on either directly or indirectly."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "febf5fe7",
   "metadata": {},
   "source": [
    "## 1: Which package has the most direct dependencies and how many?"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "71c07e18",
   "metadata": {},
   "source": [
    "### Redshift"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "a631377d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(['Products.CMFPlone', 100],)"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cursor = conn.cursor()\n",
    "query = \"\"\"\n",
    "    SELECT TOP 1 *\n",
    "    FROM \n",
    "    (\n",
    "        SELECT package, count(*) as \"dep_count\"\n",
    "        FROM dependencies\n",
    "        WHERE dependency is not NULL\n",
    "        GROUP BY package\n",
    "    ) DepCounts\n",
    "    ORDER BY dep_count DESC, package ASC\n",
    "\n",
    "\"\"\"\n",
    "cursor.execute(query)\n",
    "cursor.fetchall()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "5dc92476",
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'f' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-63-1a5f49edb4ea>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mtimeRedshiftQuery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m<ipython-input-62-d6191f94fbc5>\u001b[0m in \u001b[0;36mtimeRedshiftQuery\u001b[0;34m(sqlTxt)\u001b[0m\n\u001b[1;32m      2\u001b[0m     \u001b[0mcursor\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mconn\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcursor\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m     \u001b[0mf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mlambda\u001b[0m \u001b[0;34m:\u001b[0m \u001b[0mcursor\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mexecute\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msqlText\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 4\u001b[0;31m     \u001b[0;32mreturn\u001b[0m \u001b[0mtimeit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"f()\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      5\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      6\u001b[0m \u001b[0;32mdef\u001b[0m \u001b[0mtimeNeptuneQuery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mf\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/JupyterSystemEnv/lib/python3.7/timeit.py\u001b[0m in \u001b[0;36mtimeit\u001b[0;34m(stmt, setup, timer, number, globals)\u001b[0m\n\u001b[1;32m    231\u001b[0m            number=default_number, globals=None):\n\u001b[1;32m    232\u001b[0m     \u001b[0;34m\"\"\"Convenience function to create Timer object and call timeit method.\"\"\"\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 233\u001b[0;31m     \u001b[0;32mreturn\u001b[0m \u001b[0mTimer\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mstmt\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msetup\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimer\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mglobals\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtimeit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mnumber\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    234\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    235\u001b[0m def repeat(stmt=\"pass\", setup=\"pass\", timer=default_timer,\n",
      "\u001b[0;32m~/anaconda3/envs/JupyterSystemEnv/lib/python3.7/timeit.py\u001b[0m in \u001b[0;36mtimeit\u001b[0;34m(self, number)\u001b[0m\n\u001b[1;32m    175\u001b[0m         \u001b[0mgc\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdisable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    176\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 177\u001b[0;31m             \u001b[0mtiming\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0minner\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mit\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtimer\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    178\u001b[0m         \u001b[0;32mfinally\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    179\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mgcold\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/JupyterSystemEnv/lib/python3.7/timeit.py\u001b[0m in \u001b[0;36minner\u001b[0;34m(_it, _timer)\u001b[0m\n",
      "\u001b[0;31mNameError\u001b[0m: name 'f' is not defined"
     ]
    }
   ],
   "source": [
    "timeRedshiftQuery(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0951d15c",
   "metadata": {},
   "source": [
    "### Neptune"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "3c131b7c",
   "metadata": {},
   "outputs": [],
   "source": [
    "def query(g):\n",
    "    g.V().hasLabel('package').inE('depends_on'). \\\n",
    "    groupCount().by('package').as_('group'). \\\n",
    "    order(Scope.local). \\\n",
    "        by('values', Order.desc). \\\n",
    "        by('keys', Order.asc). \\\n",
    "    unfold().limit(1).toList()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "94d0a8bf",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "f37e7fd6dd04455cada2b3e7a892c37d",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V().hasLabel('package').in('depends_on').\n",
    "groupCount().by(id).\n",
    "order(Scope.local).\n",
    "    by(values, Order.desc).\n",
    "    by(keys, Order.asc).\n",
    "unfold().limit(1)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "193c952d",
   "metadata": {},
   "source": [
    "# 3: Which packages depend on Pandas (directly and indirectly)?"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5d97bb82",
   "metadata": {},
   "source": [
    "## Redshift"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "06db3ab4",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(['ADAM-Tools'],\n",
       " ['BiologicalProcessNetworks'],\n",
       " ['dcmt'],\n",
       " ['django-instakit'],\n",
       " ['fastinterval'],\n",
       " ['gyroid'],\n",
       " ['hdf5-django'],\n",
       " ['lmj.c3d'],\n",
       " ['lmj.nethack'],\n",
       " ['lmj.rbm'],\n",
       " ['nplook'],\n",
       " ['oceans'],\n",
       " ['PyBUFR'],\n",
       " ['pyorbital'],\n",
       " ['python-consume'],\n",
       " ['pyucsc'],\n",
       " ['RTM'],\n",
       " ['smith'],\n",
       " ['zipline'],\n",
       " ['pyucsc'],\n",
       " ['canvas'],\n",
       " ['chebpy'],\n",
       " ['fitsio'],\n",
       " ['gceising'],\n",
       " ['gsw'],\n",
       " ['h5dj'],\n",
       " ['his2h5'],\n",
       " ['linguistic-helper-functions'],\n",
       " ['lmj.kohonen'],\n",
       " ['lmj.particle'],\n",
       " ['lmj.plot'],\n",
       " ['lmj.pursuit'],\n",
       " ['metaseq'],\n",
       " ['multichain_mcmc'],\n",
       " ['nwalign'],\n",
       " ['ocupy'],\n",
       " ['pyRserve'],\n",
       " ['readfmf'],\n",
       " ['SimpleHist'],\n",
       " ['topzootools'])"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "    WITH RECURSIVE panda_deps(package, dependency, level) AS \n",
    "    (SELECT package, dependency, 0 AS level \n",
    "     FROM dependencies\n",
    "     WHERE dependency = 'numpy'\n",
    "     UNION ALL\n",
    "     SELECT d.package, d.dependency, level + 1\n",
    "     FROM dependencies d, panda_deps p\n",
    "     WHERE d.dependency = p.package\n",
    "    )\n",
    "    SELECT package FROM panda_deps;\n",
    "\n",
    "\"\"\"\n",
    "cursor.execute(query)\n",
    "cursor.fetchall()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "f6b23091",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.0029741880002802645"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "timeRedshiftQuery(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c9b0c663",
   "metadata": {},
   "source": [
    "# 4: Which packages have multiple dependency?\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a5251559",
   "metadata": {},
   "source": [
    "## Redshift"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "fa75d556",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(['abl.jquery.ui'],\n",
       " ['abu.rpc'],\n",
       " ['actdiag'],\n",
       " ['ADAM-Tools'],\n",
       " ['afpy.xap'],\n",
       " ['AgileCLU'],\n",
       " ['agsci.blognewsletter'],\n",
       " ['anthill.skinner'],\n",
       " ['archetypes.fieldtraverser'],\n",
       " ['archetypes.recurringdate'],\n",
       " ['Argot'],\n",
       " ['Art3dUtils'],\n",
       " ['asm.cms'],\n",
       " ['asm.cmsui'],\n",
       " ['assentio'],\n",
       " ['assert-select'],\n",
       " ['atomisator.outputs'],\n",
       " ['atreal.massloader'],\n",
       " ['Attest'],\n",
       " ['AuthBWC'],\n",
       " ['aws.authrss'],\n",
       " ['aws.windowsplonecluster'],\n",
       " ['baanlib'],\n",
       " ['baas'],\n",
       " ['babble.demo'],\n",
       " ['baboon'],\n",
       " ['balanced-ach'],\n",
       " ['bam2fpkc'],\n",
       " ['bamboo'],\n",
       " ['batchhttp'],\n",
       " ['Batman'],\n",
       " ['bda.calendar.base'],\n",
       " ['bda.intellidatetime'],\n",
       " ['bda.plone.finder'],\n",
       " ['BeakerHelpers'],\n",
       " ['beanstalk-stack'],\n",
       " ['bebop'],\n",
       " ['beeswithmachineguns'],\n",
       " ['beets'],\n",
       " ['benchmaster'],\n",
       " ['bibliograph.rendering'],\n",
       " ['bingpy'],\n",
       " ['bitmat'],\n",
       " ['bitsyauth'],\n",
       " ['bitsyblog'],\n",
       " ['blockdiagcontrib-square'],\n",
       " ['blogdown'],\n",
       " ['bob.example.faceverify'],\n",
       " ['bongo'],\n",
       " ['bookreader'],\n",
       " ['Boris'],\n",
       " ['boto_utils'],\n",
       " ['botox'],\n",
       " ['bowerrecipe'],\n",
       " ['braspag'],\n",
       " ['brubeck'],\n",
       " ['brzipcode'],\n",
       " ['bugh'],\n",
       " ['buildout.removeaddledeggs'],\n",
       " ['buildout.umask'],\n",
       " ['bundle-celery'],\n",
       " ['BunnyFooFoo'],\n",
       " ['busyflow.pivotal'],\n",
       " ['bzrsync'],\n",
       " ['caldav'],\n",
       " ['candy.candy'],\n",
       " ['carp'],\n",
       " ['celerydeploy'],\n",
       " ['celery-tracker'],\n",
       " ['celery-with-mongodb'],\n",
       " ['celery-with-redis'],\n",
       " ['census'],\n",
       " ['charbeat'],\n",
       " ['charmrunner'],\n",
       " ['chessproblem.ui'],\n",
       " ['chill'],\n",
       " ['chrome'],\n",
       " ['cioppino.twothumbs'],\n",
       " ['cipher.callscript'],\n",
       " ['ckanext-datapreview'],\n",
       " ['ckanext-wordpresser'],\n",
       " ['claun'],\n",
       " ['clearwind.arecibo'],\n",
       " ['Cleverbox'],\n",
       " ['ClosureBuilder'],\n",
       " ['cloudplay'],\n",
       " ['Clutch'],\n",
       " ['CLVault'],\n",
       " ['clwapp'],\n",
       " ['cmsplugin-blog'],\n",
       " ['Cobaya'],\n",
       " ['CodernityDB-PyClient'],\n",
       " ['codespeed'],\n",
       " ['Coffin'],\n",
       " ['CoilMQ'],\n",
       " ['coinor.coopr'],\n",
       " ['collective.actions.delete'],\n",
       " ['collective.advancedsearchtamer'],\n",
       " ['collective.amberjack.core'],\n",
       " ['collective.amberjack.portlet'],\n",
       " ['collective.anotherdynamicgroupsplugin'],\n",
       " ['collective.atcassandrastorage'],\n",
       " ['collective.autorestart'],\n",
       " ['collective.blog.feeds'],\n",
       " ['collective.blog.star'],\n",
       " ['collective.blog.view'],\n",
       " ['collective.blueprint.base'],\n",
       " ['collective.blueprint.translationlinker'],\n",
       " ['collective.buildbot'],\n",
       " ['collective.catalogexport'],\n",
       " ['collective.categorizing'],\n",
       " ['collective.codemirror'],\n",
       " ['collective.collage.plonetruegallery'],\n",
       " ['collective.collage.windowz'],\n",
       " ['collective.collection.yearview'],\n",
       " ['collective.configviews'],\n",
       " ['collective.contentstats'],\n",
       " ['collective.contextualcontactinfo'],\n",
       " ['collective.deepsitemap'],\n",
       " ['collective.dnifield'],\n",
       " ['collective.easytemplate'],\n",
       " ['collective.flattr'],\n",
       " ['collective.flowplayerclipviews'],\n",
       " ['collective.folderorder'],\n",
       " ['collective.genericsetup.ldap'],\n",
       " ['collective.geo.bundle'],\n",
       " ['collective.geo.geopoint'],\n",
       " ['collective.geo.json'],\n",
       " ['collective.geo.opensearch'],\n",
       " ['collective.gmaplocation'],\n",
       " ['collective.googleforms'],\n",
       " ['collective.groupdashboard'],\n",
       " ['collective.gsa64'],\n",
       " ['collective.gtags'],\n",
       " ['collective.ie8nomore'],\n",
       " ['collective.imageinbox'],\n",
       " ['collective.jaop'],\n",
       " ['collective.jqhistory'],\n",
       " ['collective.js.innerfade'],\n",
       " ['collective.js.oembed'],\n",
       " ['collective.js.slimbox2'],\n",
       " ['collective.js.twittertext'],\n",
       " ['collective.lorem'],\n",
       " ['collective.megaphonesql'],\n",
       " ['collective.miscbehaviors'],\n",
       " ['collective.nextprev'],\n",
       " ['collective.onlogin'],\n",
       " ['collective.opensearch'],\n",
       " ['collective.ots'],\n",
       " ['collective.pdfLeadImage'],\n",
       " ['collective.pfg.soup'],\n",
       " ['collective.pfg.sqladapter'],\n",
       " ['collective.pfg.sslfield'],\n",
       " ['collective.portlet.contentleadimage'],\n",
       " ['collective.portlet.links'],\n",
       " ['collective.portlet.postit'],\n",
       " ['collective.portlet.skype'],\n",
       " ['collective.portlet.userActionsPortlet'],\n",
       " ['collective.portlet.usertrack'],\n",
       " ['collective.portlet.wordpress'],\n",
       " ['collective.portlet.workflowsteps'],\n",
       " ['collective.prettyphoto'],\n",
       " ['collective.pygal.plonestats'],\n",
       " ['collective.recipe.environment'],\n",
       " ['collective.recipe.funkload'],\n",
       " ['collective.recipe.hudsonjob'],\n",
       " ['collective.recipe.isapiwsgi'],\n",
       " ['collective.recipe.moin'],\n",
       " ['collective.recipe.ropeproject'],\n",
       " ['collective.recipe.scriptgen'],\n",
       " ['collective.recipe.shelloutput'],\n",
       " ['collective.recipe.zope2cluster'],\n",
       " ['collective.redirect'],\n",
       " ['collective.registry'],\n",
       " ['collective.relateditems'],\n",
       " ['collective.salesforce.query'],\n",
       " ['collective.searchweightings'],\n",
       " ['collective.sugarcrm'],\n",
       " ['collective.templateengines'],\n",
       " ['collective.theme.iwaters'],\n",
       " ['collective.transform.multimarkdown'],\n",
       " ['collective.validator.xhtmlTransitional'],\n",
       " ['collective.viewlet.links'],\n",
       " ['collective.viewportletmanager'],\n",
       " ['collective.wfautodoc'],\n",
       " ['collective.wysiwyg_biografy'],\n",
       " ['collective.z3cform.datagridfield-demo'],\n",
       " ['collective.z3cform.norobots'],\n",
       " ['Command-Tools'],\n",
       " ['CommonBWC'],\n",
       " ['compmake'],\n",
       " ['configmgr'],\n",
       " ['convert2x'],\n",
       " ['CorePost'],\n",
       " ['cornerstone.cssvar'],\n",
       " ['cotendo'],\n",
       " ['couchclient'],\n",
       " ['couchdb-session'],\n",
       " ['crank'],\n",
       " ['crawley-dev'],\n",
       " ['Crowd'],\n",
       " ['cssbuster'],\n",
       " ['css.fontawesome'],\n",
       " ['curling'],\n",
       " ['curl_proxies_checker'],\n",
       " ['Cydra'],\n",
       " ['d2m.rendersource'],\n",
       " ['daedalus'],\n",
       " ['databundles'],\n",
       " ['dataflake.docbuilder'],\n",
       " ['dataflake.ldapconnection'],\n",
       " ['datahub'],\n",
       " ['DataPipeline'],\n",
       " ['datapkg'],\n",
       " ['datastore'],\n",
       " ['dataTXT'],\n",
       " ['datautil'],\n",
       " ['dateable.chronos'],\n",
       " ['dbag'],\n",
       " ['debug'],\n",
       " ['decoupage'],\n",
       " ['DeliciousAPI'],\n",
       " ['delicious_links'],\n",
       " ['Deliverance'],\n",
       " ['Deliverance.Rewrite'],\n",
       " ['DevAuth'],\n",
       " ['devil'],\n",
       " ['dh_splitpackage'],\n",
       " ['amalgam'],\n",
       " ['amo-validator'],\n",
       " ['anobii.api'],\n",
       " ['ansible'],\n",
       " ['appfy.recipe.gae'],\n",
       " ['archetypes.configure'],\n",
       " ['argyle'],\n",
       " ['assetgen'],\n",
       " ['asynchttp'],\n",
       " ['atomisator.readers'],\n",
       " ['AuthorizeSauce'],\n",
       " ['automa'],\n",
       " ['bagit_profile'],\n",
       " ['bamboo.pantrybell'],\n",
       " ['digipy'],\n",
       " ['Django-Actuary'],\n",
       " ['django_admin_thumbnail'],\n",
       " ['django-aesfield'],\n",
       " ['django-agent-trust'],\n",
       " ['django-airbrake'],\n",
       " ['django-alert'],\n",
       " ['django-auth-fogbugz'],\n",
       " ['django-auth-hack'],\n",
       " ['django-auth_mac'],\n",
       " ['django-badgr'],\n",
       " ['django-bitfield'],\n",
       " ['django-blakey-utils'],\n",
       " ['django-blog-zinnia'],\n",
       " ['django-celery-with-mongodb'],\n",
       " ['django-classbasedsettings'],\n",
       " ['django-cms'],\n",
       " ['django-cms-opencomparison'],\n",
       " ['django-cms-social-networks'],\n",
       " ['django-codemirror-widget'],\n",
       " ['django-configglue'],\n",
       " ['django_counters'],\n",
       " ['django-data-exports'],\n",
       " ['django-daterange-filter'],\n",
       " ['django-decorators'],\n",
       " ['django-dependency'],\n",
       " ['django-detect-cyclic'],\n",
       " ['django-doccloud'],\n",
       " ['django-e1337cms'],\n",
       " ['django-ebaysync'],\n",
       " ['django-extramimetypes'],\n",
       " ['django-extra-views'],\n",
       " ['django-fagungis'],\n",
       " ['django-filer-gallery'],\n",
       " ['django-flickrsets'],\n",
       " ['django-fluent-contents'],\n",
       " ['django-forumbr'],\n",
       " ['django-fresh-media'],\n",
       " ['django-future'],\n",
       " ['django-garcimore'],\n",
       " ['django-gears'],\n",
       " ['django-generic-notifications'],\n",
       " ['django-geojson-tiles'],\n",
       " ['django-getpaid'],\n",
       " ['django_google_analytics'],\n",
       " ['django-google-credentials'],\n",
       " ['django-goto-url'],\n",
       " ['Django-Graphiti'],\n",
       " ['django-hashed-url'],\n",
       " ['django-helpers'],\n",
       " ['django-html_sanitizer'],\n",
       " ['django-hudson'],\n",
       " ['django-icons-famfamfam'],\n",
       " ['django-icons-icojoy'],\n",
       " ['django-icons-onebit'],\n",
       " ['django-icons-tango'],\n",
       " ['django-improved-inlines'],\n",
       " ['django-inviter'],\n",
       " ['django-ios-notifications'],\n",
       " ['django-jenkins'],\n",
       " ['django_jinja_middleware'],\n",
       " ['django-jqmobile'],\n",
       " ['django-kippo'],\n",
       " ['django-lean'],\n",
       " ['django-le-social'],\n",
       " ['django-lfs'],\n",
       " ['django-lithium-api'],\n",
       " ['django-livestats'],\n",
       " ['bda.awstatsparser'],\n",
       " ['bdajax'],\n",
       " ['bda.plone.wfintranet'],\n",
       " ['bernhard'],\n",
       " ['bitmagic'],\n",
       " ['Bla'],\n",
       " ['blogen'],\n",
       " ['blueprint_io'],\n",
       " ['adminish-categories'],\n",
       " ['adsense_scraper'],\n",
       " ['Aesthete'],\n",
       " ['affinitic.zamqp'],\n",
       " ['afpy.ldap'],\n",
       " ['alchemist.audit'],\n",
       " ['alchemist.ui'],\n",
       " ['alfajor'],\n",
       " ['alfredo'],\n",
       " ['altmetric'],\n",
       " ['amqp_worker'],\n",
       " ['analytics'],\n",
       " ['anthill.customexport'],\n",
       " ['anybox.buildbot.openerp'],\n",
       " ['anybox.funkload.openerp'],\n",
       " ['anz.cas'],\n",
       " ['app'],\n",
       " ['apptrace'],\n",
       " ['apy'],\n",
       " ['archetypes.ldapstorage'],\n",
       " ['archetypes.memberdatastorage'],\n",
       " ['archetypes.searchwidget'],\n",
       " ['archetypes.uploadreferencewidget'],\n",
       " ['archgenxml'],\n",
       " ['archiveIO'],\n",
       " ['arcs.gsi'],\n",
       " ['arcs.shibboleth.client'],\n",
       " ['asibsync'],\n",
       " ['asiconsole'],\n",
       " ['asm.workflow'],\n",
       " ['Assessor'],\n",
       " ['atreal.richfile.preview'],\n",
       " ['Attest-latest'],\n",
       " ['auslfe.formonline.tokenaccess'],\n",
       " ['autocheck'],\n",
       " ['autoresponse'],\n",
       " ['autoscalebot'],\n",
       " ['awslib'],\n",
       " ['BaculaFS'],\n",
       " ['bakthat'],\n",
       " ['bamboo-data'],\n",
       " ['bamboo.scaffold'],\n",
       " ['BamTyper'],\n",
       " ['banana_py'],\n",
       " ['banter'],\n",
       " ['basebox'],\n",
       " ['batou'],\n",
       " ['Bazinga'],\n",
       " ['bbdb.gmailfilter'],\n",
       " ['bbricks'],\n",
       " ['bda.bfg.tile'],\n",
       " ['bda.contentproxy'],\n",
       " ['bda.ldap'],\n",
       " ['bda.plone.ajax'],\n",
       " ['bda.recipe.deployment'],\n",
       " ['bda.resultduplexer'],\n",
       " ['bda.zeopack'],\n",
       " ['bebop-server'],\n",
       " ['behance_python'],\n",
       " ['beyondskins.ploneday.site2011'],\n",
       " ['beyondskins.pythonbrasil.site'],\n",
       " ['bibliograph.core'],\n",
       " ['biofrills'],\n",
       " ['BiologicalProcessNetworks'],\n",
       " ['bioscripts.convert'],\n",
       " ['bitlyclip'],\n",
       " ['blackhole'],\n",
       " ['blah'],\n",
       " ['bleach'],\n",
       " ['blockdiagcontrib-excelhogan'],\n",
       " ['blockdiagcontrib-labeledbox'],\n",
       " ['blockdiagcontrib-qb'],\n",
       " ['bloggerfs'],\n",
       " ['blohg'],\n",
       " ['blueberry'],\n",
       " ['BNfinder'],\n",
       " ['bolt'],\n",
       " ['bootlegger'],\n",
       " ['borg.project'],\n",
       " ['botlerplate'],\n",
       " ['BottleRack'],\n",
       " ['bottle-websocket'],\n",
       " ['Bravo'],\n",
       " ['brockman'],\n",
       " ['bucket3'],\n",
       " ['bugwarrior'],\n",
       " ['busmon'],\n",
       " ['Butteur'],\n",
       " ['bw2data'],\n",
       " ['bw2ui'],\n",
       " ['c2.patch.contentslist'],\n",
       " ['c2.patch.filenamenormalizer'],\n",
       " ['c2.recipe.bitbucketbk'],\n",
       " ['canvas'],\n",
       " ['carrot'],\n",
       " ['Cartridge'],\n",
       " ['catchy'],\n",
       " ['catsnap'],\n",
       " ['celery-with-beanstalk'],\n",
       " ['cellml.recipe.api'],\n",
       " ['centipede'],\n",
       " ['cep'],\n",
       " ['CFAnalyze'],\n",
       " ['chatter'],\n",
       " ['chimpy'],\n",
       " ['chut'],\n",
       " ['CIM'],\n",
       " ['Cim2BusBranch'],\n",
       " ['cipher.background'],\n",
       " ['cipher.encryptingstorage'],\n",
       " ['cipher.longrequest'],\n",
       " ['cipher.pentahoapi'],\n",
       " ['ckanext-dgu'],\n",
       " ['clever-alexis'],\n",
       " ['clifresh'],\n",
       " ['clihelper'],\n",
       " ['clippercard'],\n",
       " ['cloudooo'],\n",
       " ['clusterfutures'],\n",
       " ['cmdbot-evented'],\n",
       " ['cmsplugin-flickr'],\n",
       " ['cmsplugin_lastfm'],\n",
       " ['cmsplugin-rst'],\n",
       " ['cmsplugin-text-wrapper'],\n",
       " ['codenode'],\n",
       " ['collective.ajaxkeywords'],\n",
       " ['collective.amberjack.plonetour'],\n",
       " ['collective.atimage.transformtoolbar'],\n",
       " ['collective.autopermission'],\n",
       " ['collective.beaker'],\n",
       " ['collective.blueprint.downloader'],\n",
       " ['collective.bouncing'],\n",
       " ['collective.calameo'],\n",
       " ['collective.classifieds'],\n",
       " ['collective.cmfeditionsdexteritycompat'],\n",
       " ['collective.collage.contentleadimage'],\n",
       " ['collective.collage.easyslider'],\n",
       " ['collective.collage.feedfeeder'],\n",
       " ['collective.collage.imagetags'],\n",
       " ['collective.collage.maps'],\n",
       " ['collective.collage.portlets'],\n",
       " ['collective.collage.rssdocument'],\n",
       " ['collective.contemplate'],\n",
       " ['collective.contentrules.mail'],\n",
       " ['collective.contentrules.mailfromfield'],\n",
       " ['collective.contentrules.mailtogroup'],\n",
       " ['collective.contentrules.tagcondition'],\n",
       " ['collective.contextimage'],\n",
       " ['collective.css3buttons'],\n",
       " ['collective.cutandpaste'],\n",
       " ['collective.dancing'],\n",
       " ['collective.dancingnotlikely'],\n",
       " ['collective.dewplayer'],\n",
       " ['collective.directoryresourcepatch'],\n",
       " ['collective.discussionplus'],\n",
       " ['collective.dist'],\n",
       " ['collective.eclipsescripts'],\n",
       " ['collective.eventinviter'],\n",
       " ['collective.folderishtraverse'],\n",
       " ['collective.funkload'],\n",
       " ['collective.galleriffic'],\n",
       " ['collective.geo.flexitopic'],\n",
       " ['collective.geo.mapcontent'],\n",
       " ['collective.geo.mapwidget'],\n",
       " ['collective.geo.polymaps'],\n",
       " ['collective.getpid'],\n",
       " ['collective.groupmail'],\n",
       " ['collective.gsqi'],\n",
       " ['collective.idashboard'],\n",
       " ['collective.imstransport'],\n",
       " ['collective.ixedit'],\n",
       " ['collective.jqueryui'],\n",
       " ['collective.js.highslide'],\n",
       " ['collective.js.jquery'],\n",
       " ['collective.js.prettify'],\n",
       " ['collective.js.underscore'],\n",
       " ['collective.lastmodifier'],\n",
       " ['collective.lastupdated'],\n",
       " ['collective.maps.geoxml'],\n",
       " ['collective.mediaShow'],\n",
       " ['collective.membercriterion'],\n",
       " ['collective.memberemails'],\n",
       " ['collective.monkeypatcherpanel'],\n",
       " ['collective.mrwiggin'],\n",
       " ['collective.navrootfield'],\n",
       " ['collective.novate'],\n",
       " ['collective.personaltags'],\n",
       " ['collective.pivottable'],\n",
       " ['collective.plonefinder'],\n",
       " ['collective.portlet.accuweather'],\n",
       " ['collective.portlet.map'],\n",
       " ['collective.portlet.paypal'],\n",
       " ['collective.portlet.quote'],\n",
       " ['collective.portlet.truereview'],\n",
       " ['collective.powertoken.core'],\n",
       " ['collective.powertoken.workflow'],\n",
       " ['collective.properties'],\n",
       " ['collective.randomheaderimage'],\n",
       " ['collective.recipe.ant'],\n",
       " ['collective.recipe.cmd'],\n",
       " ['collective.recipe.lasso'],\n",
       " ['collective.recipe.patch'],\n",
       " ['collective.recipe.pip'],\n",
       " ['collective.recipe.platform'],\n",
       " ['collective.recipe.zope2wsgi'],\n",
       " ['collective.rooter'],\n",
       " ['collective.rtvideo.vimeo'],\n",
       " ['collective.scss'],\n",
       " ['collective.searchtool'],\n",
       " ['collective.simpleeditbutton'],\n",
       " ['collective.singing'],\n",
       " ['collective.siteisolation'],\n",
       " ['collective.skinny'],\n",
       " ['collective.subscribablesections'],\n",
       " ['collective.taghelper'],\n",
       " ['collective.teaser'],\n",
       " ['collective.upgrade'],\n",
       " ['collective.vdexvocabulary'],\n",
       " ['collective.viewlet.navbar'],\n",
       " ['collective.webrichtlijnen'],\n",
       " ['collective.z3cform.colorpicker'],\n",
       " ['collective.z3cform.datetimewidget'],\n",
       " ['colorcorrect'],\n",
       " ['colourless'],\n",
       " ['computrabajo'],\n",
       " ['cone.tile'],\n",
       " ['cone.ugm'],\n",
       " ['configglue'],\n",
       " ['ContactBWC'],\n",
       " ['contenttransformer'],\n",
       " ['contextminer'],\n",
       " ['continuity'],\n",
       " ['copydog'],\n",
       " ['cornerstone.browser'],\n",
       " ['cornerstone.ui.result'],\n",
       " ['couchdbhelper'],\n",
       " ['couchpy'],\n",
       " ['cp.recipe.cmd'],\n",
       " ['craft'],\n",
       " ['crane-ec2'],\n",
       " ['crawley'],\n",
       " ['crawlidator'],\n",
       " ['crawly'],\n",
       " ['createzopecoverage'],\n",
       " ['crispy-forms-foundation'],\n",
       " ['cs.portlet.aemet'],\n",
       " ['cssmergemedia'],\n",
       " ['cyclope3'],\n",
       " ['CydraHgWebdir'],\n",
       " ['cykooz.djangorecipe'],\n",
       " ['cynq'],\n",
       " ['d'],\n",
       " ['d9t.json'],\n",
       " ['darksky'],\n",
       " ['dataflake.fakeldap'],\n",
       " ['DataGridBWC'],\n",
       " ['datahub.gov.dot.nhtsa.recall'],\n",
       " ['datanommer.models'],\n",
       " ['datastream'],\n",
       " ['dateminer'],\n",
       " ['DateUtils'],\n",
       " ['deflacue'],\n",
       " ['deployme-installer'],\n",
       " ['Dex'],\n",
       " ['dgsanco.plone3theme'],\n",
       " ['aaargh'],\n",
       " ['ABBA'],\n",
       " ['abl.jquery'],\n",
       " ['absolute32'],\n",
       " ['affinitic.docpyflakes'],\n",
       " ['Alchemytools'],\n",
       " ['applib'],\n",
       " ['appsettings'],\n",
       " ['archetypes.multilingual'],\n",
       " ['archetypes.rolefield'],\n",
       " ['asset_bundles'],\n",
       " ['Autograde'],\n",
       " ['autoreport'],\n",
       " ['aws.zope2zcmldoc'],\n",
       " ['babel-obviel'],\n",
       " ['difio-appfog-python'],\n",
       " ['django-albertson'],\n",
       " ['django-allauth'],\n",
       " ['django-appypod'],\n",
       " ['django-async-reports'],\n",
       " ['django-beanstalkd'],\n",
       " ['django-breadcrumbs'],\n",
       " ['django-careful-forms'],\n",
       " ['django-cas-provider'],\n",
       " ['django-ccgallery'],\n",
       " ['django-celery'],\n",
       " ['django-celery-transactions'],\n",
       " ['django-celery-with-beanstalk'],\n",
       " ['django-celery-with-couchdb'],\n",
       " ['django-cherrypy'],\n",
       " ['django-common-helpers'],\n",
       " ['django-cpserver-op'],\n",
       " ['django-data-importer'],\n",
       " ['django-datatables'],\n",
       " ['django-dbbackup'],\n",
       " ['django-db-pool'],\n",
       " ['django-debug-logging'],\n",
       " ['DjangoDevKit'],\n",
       " ['django-diplomat'],\n",
       " ['django-documentation'],\n",
       " ['django-engineplate'],\n",
       " ['django_excel_templates'],\n",
       " ['django-fabfile'],\n",
       " ['django-fancy-apps'],\n",
       " ['django-fitbit'],\n",
       " ['django-fortunecookie'],\n",
       " ['django-generate-scaffold'],\n",
       " ['django-generic-helpers'],\n",
       " ['django-generic-mail'],\n",
       " ['django-geoip'],\n",
       " ['django-group-access'],\n",
       " ['django-hierarchy'],\n",
       " ['django_historique'],\n",
       " ['djangohosting-recipe'],\n",
       " ['django_hstore_flattenfields'],\n",
       " ['django-hudson-25'],\n",
       " ['django-icons-web_control'],\n",
       " ['django-info'],\n",
       " ['django-instakit'],\n",
       " ['django-intranet'],\n",
       " ['django-issue-synchronisation'],\n",
       " ['django-jcache'],\n",
       " ['django-keyboard-shortcuts'],\n",
       " ['django-lastfm-auth'],\n",
       " ['django-lazysignup'],\n",
       " ['basketweaver'],\n",
       " ['Batcher'],\n",
       " ['BBQSQL'],\n",
       " ['bda.basen'],\n",
       " ['bda.cache'],\n",
       " ['betahaus.emaillogin'],\n",
       " ['bitbucket-api'],\n",
       " ['blogodev'],\n",
       " ['boilerpipy'],\n",
       " ['book.isbn'],\n",
       " ['braintree'],\n",
       " ['buildout-versions'],\n",
       " ['burn'],\n",
       " ['bzr-pqm'],\n",
       " ['c2.search.fuzzy'],\n",
       " ['cape-metrorail'],\n",
       " ['caribou'],\n",
       " ['cassandra-cli'],\n",
       " ['celery-pylons'],\n",
       " ['celerywatch'],\n",
       " ['cgi_image_thumbnailer'],\n",
       " ['chebpy'],\n",
       " ['ckanext-htsql'],\n",
       " ['ckanext-storage'],\n",
       " ['CLAM'],\n",
       " ['closure_depresolver'],\n",
       " ['cloudinary'],\n",
       " ['cmsplugin-comments'],\n",
       " ['cmsplugin-filer-gallery'],\n",
       " ['cmsplugin-footnote'],\n",
       " ['codepadr'],\n",
       " ['collect'],\n",
       " ['collective.addtofolder'],\n",
       " ['collective.barcamp'],\n",
       " ['collective.bulksharing'],\n",
       " ['collective.captchaforms'],\n",
       " ['django-magnum'],\n",
       " ['django-mailing'],\n",
       " ['django-mapistration'],\n",
       " ['django-mfw'],\n",
       " ['django-moderator'],\n",
       " ['django-money'],\n",
       " ['django-mootools-behavior'],\n",
       " ['django-order'],\n",
       " ['django-oscar-testsupport'],\n",
       " ['django-ostinato'],\n",
       " ['django-pagedown'],\n",
       " ['django-permission'],\n",
       " ['django-picklefield'],\n",
       " ['django-plugins'],\n",
       " ['django-portfolio'],\n",
       " ['django-portlets'],\n",
       " ['django-pybrowscap'],\n",
       " ['django-quicky'],\n",
       " ['django-ratchet'],\n",
       " ['django-recaptcha-field'],\n",
       " ['django-recurly'],\n",
       " ['django-reports'],\n",
       " ['django-rflatpages'],\n",
       " ['collective.collage.innerfade'],\n",
       " ['collective.doormat'],\n",
       " ['collective.eggproxy'],\n",
       " ['collective.examples.diazo'],\n",
       " ['collective.FolderContentsPortletManager'],\n",
       " ['collective.geo.kml'],\n",
       " ['collective.googledocsviewer'],\n",
       " ['collective.improvedbyline'],\n",
       " ['collective.installedpackages'],\n",
       " ['collective.js.easing'],\n",
       " ['collective.js.mousewheel'],\n",
       " ['collective.KerberosPAS'],\n",
       " ['collective.lastlogin'],\n",
       " ['collective.memberapproval'],\n",
       " ['collective.panels'],\n",
       " ['collective.pdfjs'],\n",
       " ['collective.pdfpeek'],\n",
       " ['django-rshop'],\n",
       " ['django-shop-saferpay'],\n",
       " ['django-shop-simplecategories'],\n",
       " ['django-shop-simplenotifications'],\n",
       " ['django-shop-simplevariations'],\n",
       " ['django-signalqueue'],\n",
       " ['django-simple-ratings'],\n",
       " ['django-simple-sso'],\n",
       " ['django-siteblocks'],\n",
       " ['django-sitepush'],\n",
       " ['django-slow-log'],\n",
       " ['django-smoketest'],\n",
       " ['django-socketio'],\n",
       " ['django-sorter'],\n",
       " ['django-sqlpaginator'],\n",
       " ['django-ssheepdog'],\n",
       " ['django-statsd-mozilla'],\n",
       " ['django-stored-queryset'],\n",
       " ['django-stripe-payments'],\n",
       " ['django-su'],\n",
       " ['django-taggit-live'],\n",
       " ['django-taggit-templatetags'],\n",
       " ['django-taobao'],\n",
       " ['django-teagarden'],\n",
       " ['django-template-server'],\n",
       " ['django-test-extensions'],\n",
       " ['django-testscenarios'],\n",
       " ['django-test-utils'],\n",
       " ['django-thummer'],\n",
       " ['django-userel'],\n",
       " ['django-utils2'],\n",
       " ['django-visits'],\n",
       " ['django-webcam'],\n",
       " ['django-webperf'],\n",
       " ['django-webtopay'],\n",
       " ['django-xhtml2pdf'],\n",
       " ['collective.portlet.contribute'],\n",
       " ['collective.portlet.image'],\n",
       " ['collective.portlet.rich'],\n",
       " ['collective.powertoken.view'],\n",
       " ['collective.prettyalbum'],\n",
       " ['collective.ptg.contentleadimage'],\n",
       " ['collective.recipe.celery'],\n",
       " ['collective.recipe.libsvm'],\n",
       " ['collective.recipe.minify'],\n",
       " ['collective.recipe.modwsgi'],\n",
       " ['collective.richdescription'],\n",
       " ['collective.rtvideo.metacafe'],\n",
       " ['collective.searchandreplace'],\n",
       " ['collective.securitycleanup'],\n",
       " ['collective.seo'],\n",
       " ['collective.tabr'],\n",
       " ['collective.transform.kml'],\n",
       " ['collective.validator.css'],\n",
       " ['collective.viewlet.banner'],\n",
       " ['comboloader'],\n",
       " ['coo_utils'],\n",
       " ['djbuild'],\n",
       " ['djpg'],\n",
       " ['dm.saml2'],\n",
       " ['dm.xmlsec.binding'],\n",
       " ['dm.zope.rpc.wsdl_suds'],\n",
       " ['doccito'],\n",
       " ['docutils_html5_writer'],\n",
       " ['dogpile.cache'],\n",
       " ['dolmen.app.authentication'],\n",
       " ['dolmen.app.viewselector'],\n",
       " ['dolmen.authentication'],\n",
       " ['dolmen.collection'],\n",
       " ['doppler'],\n",
       " ['Dozer'],\n",
       " ['DQuery'],\n",
       " ['Dripbox'],\n",
       " ['drupan'],\n",
       " ['dwight'],\n",
       " ['dynect'],\n",
       " ['earthengine-api'],\n",
       " ['EasyWidgets'],\n",
       " ['ebdata'],\n",
       " ['eco'],\n",
       " ['Eggcelerator'],\n",
       " ['ella'],\n",
       " ['ely.contentgenerator'],\n",
       " ['EMMSA'],\n",
       " ['enpraxis.staticsite'],\n",
       " ['enpraxis.wordpressexchange'],\n",
       " ['couch-named-python'],\n",
       " ['cov-core'],\n",
       " ['crocodoc'],\n",
       " ['CrudAlchemy'],\n",
       " ['cykooz.title'],\n",
       " ['d2m.wsgiapp'],\n",
       " ['d9t.gis'],\n",
       " ['dap.plugins.grib2'],\n",
       " ['DebugHeaders'],\n",
       " ['deego'],\n",
       " ['deform_widget_jquery_option_tree'],\n",
       " ['departmentscrape'],\n",
       " ['didit'],\n",
       " ['discoball'],\n",
       " ['disqus-python'],\n",
       " ['DistChecker'],\n",
       " ['eulxml'],\n",
       " ['Eve'],\n",
       " ['ewa'],\n",
       " ['experimental.collectionfix8463'],\n",
       " ['experimental.daterangeindexoptimisations'],\n",
       " ['f5'],\n",
       " ['Fabric'],\n",
       " ['falkolab.ext3.direct'],\n",
       " ['fassembler.configparser'],\n",
       " ['fblib'],\n",
       " ['file_syncer'],\n",
       " ['finch-cms'],\n",
       " ['firedj'],\n",
       " ['five.grok'],\n",
       " ['five.hashedresource'],\n",
       " ['Flask-Admin'],\n",
       " ['Flask-And-Redis'],\n",
       " ['Flask-Babel'],\n",
       " ['Flask-CouchDB'],\n",
       " ['Flask-Environments'],\n",
       " ['Flask-Evolution'],\n",
       " ['Flask-ExtDirect'],\n",
       " ['Flask-Gears'],\n",
       " ['Flask-Hopak'],\n",
       " ['Flask-Misaka'],\n",
       " ['Flask-MongoAlchemy'],\n",
       " ['Flask-MoreSQL'],\n",
       " ['Flask-MustacheJS'],\n",
       " ['Flask-MySQL'],\n",
       " ['Flask-oDesk'],\n",
       " ['Flask-Principal'],\n",
       " ['Flask-Psycopg2'],\n",
       " ['Flask-RQ'],\n",
       " ['Flask-S3'],\n",
       " ['Flask-Scss'],\n",
       " ['Flask-Shelve'],\n",
       " ['Flask-Social'],\n",
       " ['Flask-Static'],\n",
       " ['flixpy'],\n",
       " ['flowser'],\n",
       " ['flunc'],\n",
       " ['fluncrunner'],\n",
       " ['django-admin-bootstrapped'],\n",
       " ['django-admin-shortcuts'],\n",
       " ['django-audited-models'],\n",
       " ['django-bleach'],\n",
       " ['django-brake'],\n",
       " ['django-celery-with-redis'],\n",
       " ['django_compressor'],\n",
       " ['django-cron'],\n",
       " ['django-doorman'],\n",
       " ['django-dynamic-scraper'],\n",
       " ['django-emailpost'],\n",
       " ['ForgeHg'],\n",
       " ['formgear'],\n",
       " ['freeboxtv'],\n",
       " ['freshen'],\n",
       " ['frontweb'],\n",
       " ['frycook'],\n",
       " ['fserve'],\n",
       " ['fshttpstream'],\n",
       " ['ftp-cloudfs'],\n",
       " ['ftw.billboard'],\n",
       " ['ftw.book'],\n",
       " ['ftwbook.graphicblock'],\n",
       " ['ftw.permissionmanager'],\n",
       " ['ftw.tagging'],\n",
       " ['ftw.workspace'],\n",
       " ['fui.memberlist'],\n",
       " ['fullhistory'],\n",
       " ['garlicsim_lib'],\n",
       " ['garlicsim_py3'],\n",
       " ['geokit'],\n",
       " ['getpaid.discount'],\n",
       " ['giftwrap'],\n",
       " ['gillcup'],\n",
       " ['gist'],\n",
       " ['git-covdiff'],\n",
       " ['githooks'],\n",
       " ['github_events'],\n",
       " ['githubhook'],\n",
       " ['gitomatic'],\n",
       " ['git-review'],\n",
       " ['gitter'],\n",
       " ['gmusicapi'],\n",
       " ['gnowsys-studio'],\n",
       " ['gocept.country'],\n",
       " ['gocept.month'],\n",
       " ['gocept.objectquery'],\n",
       " ['django-extra-exceptions'],\n",
       " ['django-fabdeploy-plus'],\n",
       " ['django_factory'],\n",
       " ['django-fluent-dashboard'],\n",
       " ['django-hashedfilenamestorage'],\n",
       " ['django-htmlmin'],\n",
       " ['django-iban'],\n",
       " ['django-icybackup'],\n",
       " ['django-imagequery'],\n",
       " ['django-informant'],\n",
       " ['django-inline-ordering'],\n",
       " ['django-janitor'],\n",
       " ['django-journal'],\n",
       " ['django-jqtouch'],\n",
       " ['django-jqueryfileupload'],\n",
       " ['django-knowledge'],\n",
       " ['django-load'],\n",
       " ['django-localdevstorage'],\n",
       " ['django-location'],\n",
       " ['django-mailmodel'],\n",
       " ['django-mesh'],\n",
       " ['gocept.recipe.deploymentsandbox'],\n",
       " ['gocept.recipe.env'],\n",
       " ['gocept.runner'],\n",
       " ['gocept.sortfiles'],\n",
       " ['gocept.xmlrpcskin'],\n",
       " ['gomobile.mobile'],\n",
       " ['gp.recipe.node'],\n",
       " ['gp.recipe.phantomjs'],\n",
       " ['gp.vcsdevelop'],\n",
       " ['gracie'],\n",
       " ['GrailTact'],\n",
       " ['graphitepager'],\n",
       " ['grokcore.annotation'],\n",
       " ['grokcore.catalog'],\n",
       " ['grokcore.component'],\n",
       " ['grokcore.json'],\n",
       " ['grokcore.registries'],\n",
       " ['grokcore.site'],\n",
       " ['grokcore.startup'],\n",
       " ['grokcore.traverser'],\n",
       " ['grokui.base'],\n",
       " ['ground-soil'],\n",
       " ['grouparchy.schema'],\n",
       " ['gtkeggdeps'],\n",
       " ['gtwpy'],\n",
       " ['gum'],\n",
       " ['gunicorn-console'],\n",
       " ['hamper'],\n",
       " ['hand'],\n",
       " ['hapicake'],\n",
       " ['hapipy'],\n",
       " ['haufe.releaser'],\n",
       " ['haufe.selenium'],\n",
       " ['haufe.sharepoint'],\n",
       " ['hermes-parser'],\n",
       " ['hg-github'],\n",
       " ['HipPocket'],\n",
       " ['django-minimizer'],\n",
       " ['django-mongodb-engine'],\n",
       " ['django-netfields'],\n",
       " ['django-nginx-image'],\n",
       " ['django-object-permission'],\n",
       " ['django_openkm'],\n",
       " ['django-openonmobile'],\n",
       " ['django-orm'],\n",
       " ['django-paranoia'],\n",
       " ['django-password-reset'],\n",
       " ['django-pgindex'],\n",
       " ['django-pickling'],\n",
       " ['django-pipeline-eco'],\n",
       " ['django_pony_forms'],\n",
       " ['django-positions'],\n",
       " ['django-postalcodes'],\n",
       " ['djangopypi2'],\n",
       " ['django-rails-model'],\n",
       " ['django-randomfilenamestorage'],\n",
       " ['django-ratelimit'],\n",
       " ['django-rawinclude'],\n",
       " ['django-readonly'],\n",
       " ['django-receipts'],\n",
       " ['django-render-as'],\n",
       " ['djangorestframework'],\n",
       " ['django-reversion-compare'],\n",
       " ['django-revisionfield'],\n",
       " ...)"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "WITH RECURSIVE total_deps(package, dependency, level) AS \n",
    "    (SELECT package, dependency, 0 AS level \n",
    "     FROM dependencies\n",
    "     UNION ALL\n",
    "     SELECT d.package, d.dependency, level + 1\n",
    "     FROM dependencies d, total_deps p\n",
    "     WHERE \n",
    "        d.dependency = p.package AND\n",
    "        level <= 50\n",
    "    )\n",
    "SELECT DISTINCT package from\n",
    "(\n",
    "    SELECT package, count(dependency) as total_paths\n",
    "    FROM total_deps\n",
    "    GROUP BY package, dependency\n",
    "    HAVING total_paths > 1\n",
    ") t\n",
    "\"\"\"\n",
    "cursor.execute(query)\n",
    "cursor.fetchall()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "0e8654df",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.017207170999881782"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "timeRedshiftQuery(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8768460c",
   "metadata": {},
   "source": [
    "## Neptune\n",
    "\n",
    "From each node, traverse out. Store visited nodes, and return if a visited node is found."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "41b4f45a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "920e3c5468f8445e93861fd973608cdd",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V().as('a').\n",
    "    repeat(aggregate('visited').out()).until(out().as('visited')).\n",
    "    select('a').dedup()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "399cde96",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.12"
  },
  "vscode": {
   "interpreter": {
    "hash": "3456ba5553292bb9313a9bc921b55584f884fd3b1c83a676f0c4a9c1b2dbc3c3"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
